{
  "peaks": [
    {
      "name": "Long Knife Peak",
      "lat": 48.99815,
      "lon": -114.21147,
      "elevation": 9910,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Long_Knife_Peak",
      "wikipedia_text": "Long Knife Peak (9,789 feet (2,984 m)) is located in the Clark Range, Glacier National Park in the U.S. state of Montana. Though much of the mountain slopes extend into the Canadian Province of British Columbia, the main summit is in the U.S. Long Knife Peak rises more than a vertical 1 mile (1.6 km) above Upper Kintla Lake. It is also the most northerly peak and land area in the contiguous United States above 9,000 feet (2,743 m). Long Knife Peak is on an east west ridgeline identified as the \"Boundary Mountains\" on the USGS 7.5 minute topo quad and this extended ridge, with peak 8864, also contains the most northerly named (numbered) peak and land area in the contiguous United States above 8,000 feet (2,438 m).\n\n\n== Climate ==\nBased on the Köppen climate classification, Long Knife Peak is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\nThe summit of Long Knife Peak has a tundra climate (Köppen ET) or an Alpine climate.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Most northerly peak above 9,000 feet in the contiguous US. Rises over a vertical mile above Upper Kintla Lake."
    },
    {
      "name": "Parke Peak",
      "lat": 48.94544,
      "lon": -114.23954,
      "elevation": 9010,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Parke_Peak",
      "wikipedia_text": "Parke Peak (9,043 feet (2,756 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Harris Glacier is immediately northeast of Parke Peak. The mountain is named for John G. Parke (1827–1900), of the International Boundary Survey.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for John G. Parke of the International Boundary Survey. Harris Glacier lies immediately northeast."
    },
    {
      "name": "Kintla Peak",
      "lat": 48.94385,
      "lon": -114.17133,
      "elevation": 10110,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Kintla_Peak",
      "wikipedia_text": "Kintla Peak (10,106 ft (3,080 m)) is a pyramidal peak in the Livingston Range of Glacier National Park in the U.S. state of Montana. It is the tallest mountain in the Livingston Range and the third-tallest in the park. It is also the most northerly peak and land area in the contiguous United States above 10,000 ft (3,000 m). The Agassiz Glacier lies below it to the southeast.\nKintla Peak consists of ancient Precambrian (Mesoproterozoic) rock strata that are part of the Belt Supergroup. It is named after the Kintla Lakes, and the word \"Kintla\" originates from the Kootenai word for \"sack\". Kootenai legend states that a man had apparently drowned in one of the lakes and likened the lake to a sack where \"once you got in, you couldn't get out\".\nKintla Peak lies the remote northwest corner of the park and a hike of almost 15 miles (24 km) from the nearest road is required just to reach the base of the mountain. The peak is notable for its large rise above local terrain; the elevation of nearby Upper Kintla Lake is only 4,370 feet (1,330 m). (Kintla Peak's northern neighbor Kinnerly Peak has an even more dramatic drop to Upper Kintla Lake.) This helps make Kintla \"the most arduous climb in the northwest section of the park\". The standard route is the Southeast Ridge Route, from the Agassiz Glacier basin. This route has a long approach and a large total vertical gain, and involves rock scrambling up to Class 4, in addition to some climbing on snow, depending on the season. Other routes include the East Ridge, West Face, and Upper North Face routes.\n\n\n== Climate ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\n\nKintla Peak at summitpost",
      "summary": "Tallest in the Livingston Range, third-tallest in the park. Name from Kootenai word meaning &#x27;sack.&#x27;"
    },
    {
      "name": "Kinnerly Peak",
      "lat": 48.95621,
      "lon": -114.16548,
      "elevation": 9810,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Kinnerly_Peak",
      "wikipedia_text": "Kinnerly Peak (9,949 ft (3,032 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. It is approximately 1 mile (1.6 km) north of Kintla Peak, the highest peak in the Livingston Range, and 3 miles (4.8 km) south of the Canada–United States border. Both peaks are in the remote northwest corner of the park. Kinnerly Peak is the eighth tallest peak in Glacier National Park.\nKinnerly Peak is notable for its huge north face, which rises steeply from Upper Kintla Lake. From the lake to the summit is an elevation gain of 5,573 feet (1,699 m) in approximately a horizontal 1 mile (1.6 km).\nThe first recorded ascent of Kinnerly Peak was made by a Sierra Club party led by the noted mountaineer Norman Clyde, in 1937. The standard climbing route ascends the northwest face, starting from the south shore of Upper Kintla Lake. It involves a large amount of elevation gain, mostly by scrambling, but with some exposed and mildly technical sections (Class 4 or easy Class 5). Other routes exist on the southeast and southwest faces.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Kinnerly is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Eighth tallest peak. North face rises 5,573 feet from Upper Kintla Lake in just one horizontal mile."
    },
    {
      "name": "Numa Peak",
      "lat": 48.90347,
      "lon": -114.16127,
      "elevation": 8710,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Numa_Peak",
      "wikipedia_text": "Numa Peak (9,007 feet (2,745 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. The small Baby Glacier is below the peak to the immediate northeast. Numa Peak is the high point along Numa Ridge and rises almost 5,000 feet (1,500 m) above Bowman Lake.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "High point of Numa Ridge. Rises almost 5,000 feet above Bowman Lake. Baby Glacier sits below to the northeast."
    },
    {
      "name": "Mount Peabody",
      "lat": 48.92986,
      "lon": -114.14075,
      "elevation": 9210,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Peabody",
      "wikipedia_text": "Mount Peabody (9,221 feet (2,811 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Agassiz Glacier is located on the western slopes of Mount Peabody.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Agassiz Glacier, one of the park&#x27;s larger glaciers, lies on its western slopes."
    },
    {
      "name": "Reuter Peak",
      "lat": 48.91158,
      "lon": -114.20176,
      "elevation": 8763,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Reuter_Peak",
      "wikipedia_text": "Reuter Peak (8,763 feet (2,671 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Remote summit in the Livingston Range."
    },
    {
      "name": "Rainbow Peak",
      "lat": 48.87867,
      "lon": -114.09737,
      "elevation": 9890,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Rainbow_Peak",
      "wikipedia_text": "Rainbow Peak (9,895 feet (3,016 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. The namesake Rainbow Glacier is immediately east and northeast of Rainbow Peak. Rainbow Peak is the ninth-tallest mountain in Glacier National Park and rises over 1 mile (1.6 km) above Bowman Lake. From the parking lot at the Bowman Lake Campground, the elevation gain is 5,865 ft (1,788 m).\nIn July 1998 the peak was the site of the death of two climbers who were climbing a snow-covered chimney when a cornice collapsed, causing the two climbers to fall to their deaths.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Ninth-tallest mountain in the park. Site of a 1998 fatal climbing accident when a cornice collapsed."
    },
    {
      "name": "Mount Carter",
      "lat": 48.89202,
      "lon": -114.07775,
      "elevation": 9843,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Carter_(Montana)",
      "wikipedia_text": "Mount Carter (9,848 feet (3,002 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Rainbow Glacier is just south of Mount Carter while Weasel Collar Glacier is immediately northeast. Mount Carter is the tenth tallest peak in Glacier National Park.\n\n\n== Climate ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Tenth tallest peak in the park. Rainbow Glacier lies south, Weasel Collar Glacier northeast."
    },
    {
      "name": "The Guardhouse",
      "lat": 48.9158,
      "lon": -114.01675,
      "elevation": 9336,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/The_Guardhouse",
      "wikipedia_text": "The Guardhouse (9,341 feet (2,847 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. The Guardhouse is situated on the Continental Divide.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Situated on the Continental Divide."
    },
    {
      "name": "Chapman Peak",
      "lat": 48.96268,
      "lon": -114.02397,
      "elevation": 9406,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Chapman_Peak",
      "wikipedia_text": "Chapman Peak (9,411 feet (2,868 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Chapman Peak is situated along the Continental Divide. The mountain is named for Robert H. Chapman, one of the US Geological Survey topographers who worked on mapping Glacier Park between 1900 and 1904.\n\n\n== Climate ==\nBased on the Köppen climate classification, Chapman Peak is located in a subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Chapman Peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== References ==",
      "summary": "Named for Robert H. Chapman, USGS topographer who mapped the park from 1900-1904."
    },
    {
      "name": "Mount Custer",
      "lat": 48.98002,
      "lon": -114.05818,
      "elevation": 8883,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Custer",
      "wikipedia_text": "Mount Custer (8,888 feet (2,709 m)) is a mountain in the Livingston Range, Glacier National Park in the U.S. state of Montana. Situated along the Continental Divide, Mount Custer rises more than 3,300 feet (1,000 m) above Lake Nooney, located below the summit to the east. Herbst Glacier is immediately northeast of the peak. The mountain is probably named for George Armstrong Custer, of Custer's Last Stand.\n\n\n== Climate ==\nBased on the Köppen climate classification, Mount Custer has in a subarctic climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Mount Custer is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\n\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather: Mount Custer",
      "summary": "Rises 3,300 feet above Lake Nooney. Probably named after George Armstrong Custer."
    },
    {
      "name": "Boulder Peak",
      "lat": 48.95551,
      "lon": -114.09121,
      "elevation": 8528,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Boulder_Peak",
      "wikipedia_text": "Boulder Peak (8,533 feet (2,601 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. The remnant Boulder Glacier is situated on the northern slopes of the mountain.\n\n\n== Climate ==\nBased on the Köppen climate classification, Boulder Peak is located in a subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F (−23 °C) with wind chill factors below −30 °F (−34 °C)\n\n\n== Geology ==\nBoulder Peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "The remnant Boulder Glacier sits on its northern slopes."
    },
    {
      "name": "Thunderbird Mountain",
      "lat": 48.93353,
      "lon": -114.04537,
      "elevation": 8790,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Thunderbird_Mountain",
      "wikipedia_text": "Thunderbird Mountain (8,805 feet (2,684 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Thunderbird Mountain is situated on the Continental Divide. Thunderbird Glacier is located immediately northeast of the mountain.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Thunderbird Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Sits on the Continental Divide. Thunderbird Glacier lies immediately northeast."
    },
    {
      "name": "The Sentinel",
      "lat": 48.92493,
      "lon": -114.01475,
      "elevation": 8835,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Campbell Mountain",
      "lat": 48.97798,
      "lon": -113.93852,
      "elevation": 8245,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Campbell_Mountain",
      "wikipedia_text": "Campbell Mountain (8,249 feet (2,514 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Campbell Mountain rises more than 4,000 feet (1,200 m) above the west shore of Waterton Lake. The mountain is named after Archibald Campbell, who played a role in mapping the international border.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Archibald Campbell, who helped map the international border. Rises 4,000 feet above Waterton Lake."
    },
    {
      "name": "Olson Mountain",
      "lat": 48.95719,
      "lon": -113.93756,
      "elevation": 7913,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Olson_Mountain",
      "wikipedia_text": "Olson Mountain,  also known as Mount Olson, is a  7,913-foot-elevation (2,412 m) mountain summit located in the Livingston Range, of Glacier National Park in the U.S. state of Montana. Olson Mountain rises more than 3,700 feet (1,100 m) above the western shore of Waterton Lake. The mountain was named for a surveyor on the International Boundary Survey, with the name officially adopted in 1929. The nearest higher peak is Campbell Mountain, 1.13 miles (1.82 km) to the north, and Citadel Peaks is two miles (3.2 km) to the south. Precipitation runoff from the mountain drains into Olson Creek before it empties to Waterton Lake.\n\n\n== Climate ==\nBased on the Köppen climate classification, Olson Mountain is located in a subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Olson Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Olson Mountain\nNational Park Service web site: Glacier National Park",
      "summary": "Named for a surveyor on the International Boundary Survey. Rises 3,700 feet above Waterton Lake."
    },
    {
      "name": "Shaheeya Peak",
      "lat": 48.95565,
      "lon": -113.97342,
      "elevation": 8052,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Shaheeya_Peak",
      "wikipedia_text": "Shaheeya Peak (8,052 feet (2,454 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana.  Shaheeya Lake is just east of the peak and Wahseeja Lake is to the northwest.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Shaheeya Lake sits just east; Wahseeja Lake to the northwest."
    },
    {
      "name": "Porcupine Ridge",
      "lat": 48.91721,
      "lon": -113.96165,
      "elevation": 8695,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Porcupine_Ridge",
      "wikipedia_text": "Porcupine Ridge is a prominent mountain ridge located in the Goat Haunt area of Glacier National Park, in Glacier County of the U.S. state of Montana. This mountain is part of the Livingston Range, and is situated 1.5 mile east of the Continental Divide. Topographic relief is significant as the summit rises approximately 3,900 feet (1,200 meters) above Lake Frances in one mile, and nearly 5,000 feet (1,500 meters) above Waterton Lake in five miles. Precipitation runoff from the mountain drains to the Waterton River via Olson and Valentine Creeks. This geographical feature's name was officially adopted in 1911 by the United States Board on Geographic Names.\n\n\n== Climate ==\nBased on the Köppen climate classification, Porcupine Ridge is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F with wind chill factors below −20 °F. This climate supports the remnant of an unnamed glacier on the northeast aspect below the summit.\n\n\n== Geology ==\nLike the mountains in Glacier National Park, Porcupine Ridge is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Porcupine Ridge\nNational Park Service web site: Glacier National Park\nPorcupine Ridge fire lookout (photo): Flickr",
      "summary": "Dramatic mountain ridge in Goat Haunt area. Rises 5,000 feet above Waterton Lake. Hosts Porcupine Ridge fire lookout."
    },
    {
      "name": "Citadel Peaks",
      "lat": 48.93295,
      "lon": -113.92344,
      "elevation": 8080,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Citadel_Peaks",
      "wikipedia_text": "Citadel Peaks is a mountain ridge located in the Goat Haunt area of Glacier National Park, in Glacier County of the U.S. state of Montana. This arête with a row of sharp points is part of the Livingston Range, and is approximately four miles east of the Continental Divide. Neighbors include Olson Mountain, two miles (3.2 km) to the north, Mount Cleveland four miles (6.4 km) to the east, and Kootenai Peak 2.7 miles (4.3 km) to the south. Topographic relief is significant as Citadel Peaks rises over 3,800 feet (1,200 meters) above Waterton Lake in less than two miles, and 3,000 feet (910 meters) above Lake Janet in one mile. Precipitation runoff from the mountain drains to the south end of Waterton Lake. The first ascent of Citadel Spire, a major pinnacle on the ridge, was made in 1967 by Jerry Kanzler, Jim Kanzler, Ray Martin, and Clare Pogreba. This geographical feature's name was officially adopted in 1929 by the United States Board on Geographic Names. To the Pikuni people, Citadel Peaks is known as \"Ataniawxis\", meaning \"The Needles\".\n\n\n== Climate ==\nBased on the Köppen climate classification, Citadel Peaks is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike the mountains in Glacier National Park, Citadel Peaks is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\n\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Citadel Peaks\nNational Park Service web site: Glacier National Park",
      "summary": "Ar&ecirc;te with sharp points. Known to Pikuni as &#x27;Ataniawxis&#x27; meaning &#x27;The Needles.&#x27; First non-native ascent in 1967."
    },
    {
      "name": "Kootenai Peak",
      "lat": 48.89013,
      "lon": -113.94187,
      "elevation": 8542,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Kootenai_Peak",
      "wikipedia_text": "Kootenai Peak (8,542 feet (2,604 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Kootenai Peak is in the northeastern section of Glacier National Park.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Gallery ==\n\n\n== References ==",
      "summary": "Located in the park&#x27;s northeastern section."
    },
    {
      "name": "Miche Wabun Peak",
      "lat": 48.96961,
      "lon": -113.83118,
      "elevation": 8861,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Miche_Wabun_Peak",
      "wikipedia_text": "Miche Wabun Peak (8,866 feet (2,702 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Miche Wabun Peak is in the northeastern section of Glacier National Park and is north of Miche Wabun Lake.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "North of Miche Wabun Lake in the northeastern section."
    },
    {
      "name": "Sarcee Mountain",
      "lat": 48.98842,
      "lon": -113.78792,
      "elevation": 8353,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Sarcee_Mountain",
      "wikipedia_text": "Sarcee Mountain (8,353 feet (2,546 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Sarcee Mountain is in the northeastern region of the park.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the northeastern region of the park."
    },
    {
      "name": "Goat Haunt Mountain",
      "lat": 48.95081,
      "lon": -113.84871,
      "elevation": 8641,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Goat_Haunt_Mountain",
      "wikipedia_text": "Goat Haunt Mountain (8,646 feet (2,635 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Goat Haunt Mountain is in the northeastern section of Glacier National Park, approximately 1.85 miles (2.98 km) north of Mount Cleveland. The stagnant Miche Wabun Glacier is located on the eastern slopes of the mountain. The total altitude gain from the trailhead to the mountain summit is more than 4,400 ft (1,300 m). Goat Haunt Lake is northwest of the peak.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Near the Canadian border. Miche Wabun Glacier sits on eastern slopes. Goat Haunt Lake is northwest."
    },
    {
      "name": "Kaina Mountain",
      "lat": 48.95395,
      "lon": -113.79867,
      "elevation": 9489,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Kaina_Mountain",
      "wikipedia_text": "Kaina Mountain (9,494 feet (2,894 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Kaina Mountain is in the northeastern section of Glacier National Park and north of Kaina Lake.\n\n\n== Climate ==\nBased on the Köppen climate classification, Kaina is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Kaina is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "North of Kaina Lake in the northeastern section."
    },
    {
      "name": "Bear Mountain",
      "lat": 48.95509,
      "lon": -113.75765,
      "elevation": 8841,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Curly_Bear_Mountain",
      "wikipedia_text": "Curly Bear Mountain (8,099 feet (2,469 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Curly Bear Mountain is easily seen from the village of Saint Mary, Montana rising just west of Divide Mountain. The peak was named after Blackfoot warrior and historian Curly Bear (Kyáiyo-xusi).\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Blackfoot warrior and historian Curly Bear (Ky&aacute;iyo-xusi). Easily seen from St. Mary village."
    },
    {
      "name": "Mount Cleveland",
      "lat": 48.92485,
      "lon": -113.84819,
      "elevation": 10466,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Cleveland_(Montana)",
      "wikipedia_text": "Mount Cleveland is the highest mountain in Glacier National Park, located in Montana, United States. It is also the highest point in the Lewis Range, which spans part of the northern portion of the park and extends into Canada. It is located approximately 3 mi (4.8 km) southeast of the southern end of Waterton Lake, and approximately 5 mi (8.0 km) south of the US–Canada border. The east side of the future national park was purchased by the federal government from the Blackfoot Confederacy in 1895 during the second term of President Grover Cleveland. According to the United States Board on Geographic Names, the mountain is named for the former president.\nWhile not of great absolute elevation (the mountain is more than 2,300 ft (700 m) lower than Granite Peak, the highest peak in Montana), Mount Cleveland is notable for its large, steep rise above local terrain. For example, its west flank rises over 5,500 ft (1,700 m) in less than 2 mi (3.2 km); the northwest face, the steepest on the mountain, rises 4,000 ft (1,200 m) in less than 0.4 mi (0.64 km). The other faces show almost as much vertical relief. This scale and steepness of relief is quite rare in the contiguous United States. Mount Cleveland ranks 50th on the list of peaks in the contiguous U.S. with the greatest topographic prominence. The massif upon which Mount Cleveland is situated also includes 10,001-foot (3,048 m) Kaiser Point, which is the seventh-highest peak in the park and is only .67 mi (1.08 km) to the northeast.\n\n\n== Climbing ==\nThe first recorded ascent of Mount Cleveland was in 1920 by Frank B. Wynn. The easiest route on the peak is the West Face route, starting from the Waterton Valley; it is a Class 3 scramble with the possibility of some short exposed Class 4 sections.\nOther routes include the Stoney Indian Route, from Stoney Indian Pass to the south of the peak, first descended by noted Sierra mountaineer Norman Clyde and party in 1937; various routes on the Southeast Face; and the more difficult North (or Northwest) Face, climbed partially in 1971 and completely in 1976.\nAlthough the peak has a relatively low fatality record, five Montana climbers were killed on the peak's west face in December 1969. The climbers were swept away by an avalanche and were not found for seven months.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F (−23 °C) with wind chill factors below −30 °F (−34 °C).\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period. The bulk of the peak is composed of limestone of the Siyeh Formation, and the conspicuous dark band on the north face is a diorite sill.\n\n\n== Gallery ==\n\n\n== See also ==\n\nList of mountain peaks of North America\nList of mountain peaks of the United States\nList of Ultras of the United States\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\n\n\"Mount Cleveland\". Geographic Names Information System. United States Geological Survey, United States Department of the Interior. Retrieved December 8, 2009.\n\"Mount Cleveland\". SummitPost.org. Retrieved December 8, 2009.",
      "summary": "Highest peak in the park. Named for President Grover Cleveland. West flank rises 5,500 feet in under 2 miles."
    },
    {
      "name": "Whitecrow Mountain",
      "lat": 48.90862,
      "lon": -113.82412,
      "elevation": 7710,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Whitecrow_Mountain_(Montana)",
      "wikipedia_text": "Whitecrow Mountain is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Stoney Indian Peaks",
      "lat": 48.89995,
      "lon": -113.8573,
      "elevation": 9110,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Stoney_Indian_Peaks",
      "wikipedia_text": "Stoney Indian Peaks (9,355 feet (2,851 m)) are located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Consisting of several summits, the mountain is in the northeastern region of Glacier National Park, less than 2 miles (3.2 km) south of Mount Cleveland. Stoney Indian Lake is south of the peaks.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Multiple summits less than 2 miles south of Mount Cleveland. Stoney Indian Lake lies to the south."
    },
    {
      "name": "Wahcheeche Mountain",
      "lat": 48.8828,
      "lon": -113.87421,
      "elevation": 8477,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Wahcheechee_Mountain",
      "wikipedia_text": "Wahcheechee Mountain (8,418 feet (2,566 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Stoney Indian Lake is just northeast of the peak.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers.\nTemperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike the mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nSoutheast aspect of Wahcheechee Mountain (photo): Flickr\nEast aspect of Wahcheechee Mountain (photo): Flickr",
      "summary": "Stoney Indian Lake lies just to the east."
    },
    {
      "name": "Sentinel Mountain",
      "lat": 48.97894,
      "lon": -113.7463,
      "elevation": 8245,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Sentinel_Mountain_(Montana)",
      "wikipedia_text": "Sentinel Mountain is an 8,245-foot-elevation (2,513-meter) summit in Glacier County, Montana, United States.\n\n\n== Description ==\nSentinel Mountain is located 1.3 miles (2.1 km) south of the Canada–United States border in the Belly River area of Glacier National Park. It is situated in the Lewis Range, seven miles northwest of landmark Chief Mountain, and approximately 15 miles east of the Continental Divide. Precipitation runoff from the mountain drains into tributaries of the Belly River. Topographic relief is significant as the summit rises nearly 2,900 feet (880 meters) above the North Fork Belly River in one mile. The mountain's toponym was officially adopted in 1929 by the United States Board on Geographic Names.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Sentinel Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Sentinel Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== See also ==\n\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Sentinel Mountain",
      "summary": "In the Belly River area, 1.3 miles south of the Canadian border. Summit rises 2,900 feet in one mile."
    },
    {
      "name": "Bear Mountain",
      "lat": 48.95391,
      "lon": -113.75008,
      "elevation": 8796,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Curly_Bear_Mountain",
      "wikipedia_text": "Curly Bear Mountain (8,099 feet (2,469 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Curly Bear Mountain is easily seen from the village of Saint Mary, Montana rising just west of Divide Mountain. The peak was named after Blackfoot warrior and historian Curly Bear (Kyáiyo-xusi).\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Blackfoot warrior and historian Curly Bear (Ky&aacute;iyo-xusi). Easily seen from St. Mary village."
    },
    {
      "name": "Gable Mountain",
      "lat": 48.90596,
      "lon": -113.67398,
      "elevation": 9262,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Gable_Mountain",
      "wikipedia_text": "Gable Mountain (9,262 feet (2,823 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Gable Mountain is in the northeastern section of Glacier National Park, approximately 3 miles (4.8 km) southwest of the prominent Chief Mountain.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "About 3 miles southwest of Chief Mountain."
    },
    {
      "name": "Yellow Mountain",
      "lat": 48.88183,
      "lon": -113.63723,
      "elevation": 8766,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Yellow_Mountain_(Montana)",
      "wikipedia_text": "Yellow Mountain (8,971 feet (2,734 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Yellow Mountain forms a high ridge and connects Sherburne Peak in the east to Seward Mountain to the west.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Forms a high ridge connecting Sherburne Peak to Seward Mountain."
    },
    {
      "name": "Chief Mountain",
      "lat": 48.93269,
      "lon": -113.60976,
      "elevation": 9080,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Chief_Mountain",
      "wikipedia_text": "Chief Mountain (Blackfoot: Ninaistako) (9,085 feet or 2,769 metres) is located in the U.S. state of Montana on the eastern border of Glacier National Park and the Blackfeet Indian Reservation. The mountain is one of the most prominent peaks and rock formations along the Rocky Mountain Front, a 200-mile-long (320 km) overthrust fault, known as the Lewis Overthrust, which extends from central Montana into southern Alberta, Canada.\n\n\n== Geology ==\nChief Mountain is an example of a klippe. It consists of a Precambrian block which rests directly above much younger Cretaceous gray shales. The 1450-1400 million year old Precambrian rocks are 1300-1400 million years older than the Cretaceous rocks at the base of the mountain.\nHaving an older layer of rock juxtaposed atop younger basement rocks is found on occasion in thrust faults and is commonplace along the Lewis Overthrust which extends from central Montana to far southern Alberta. The surrounding portion of the thrust sheet has been removed by erosion leaving behind this and a few other isolated blocks of Proterozoic rock.\n\n\n== History and significance ==\nChief Mountain has been a sacred mountain to the tribes of Native Americans in the United States and First Nations in Canada for hundreds of years. The Blackfoot name for the mountain is Nínaiistáko. The peak is easily seen from Montana and Alberta due to the rapid 5,000-foot (1,500 m) altitude gain over the Great Plains which are immediately east of the mountain.\nThe mountain was seen by white explorers in the late 18th century and was known as \"Kings Peak\" on maps produced in the United Kingdom in 1795. In the early 1900s as white settlers came to the area, they observed native burial sites scattered along the base of the mountain. The name was changed in the late 19th century in reflection of Blackfeet naming of the mountain which was \"Great Chief\". When Glacier National Park was created in 1910, the summit and most prominent eastern slopes of the mountain were located within the park, leaving only the lower slopes within Blackfeet Indian Reservation.\nNatives from all over North America travel to the base of the mountain for sweet grass ceremonies, placing of prayer flags and other religious rites. Elders from Southern Alberta's Siksika Band (where the Great Chief Crowfoot hailed from) and other First Nation groups have an oral tradition that near the end of days, a Great White God would appear from the top of Chief Mountain and upon his departure, the mountain would crumble and be destroyed.\n\n\n== Climbing ==\nThe eastern face of the mountain rises over 1,500 ft (460 m) vertically and the easiest route on this section is rated class 4 by mountaineers. The rock is also primarily sedimentary and provides poor anchor points, which in turn is a contributing factor to the difficulty rating. Henry Stimson and two other explorers, including a Blackfeet Indian, climbed the difficult eastern face on September 8, 1892, and this is the first known ascent of the peak by white explorers. Upon the summit, Stimson's party observed ceremonial remains including bison skulls that had been left behind by Native Americans. The eastern face of the peak was not successfully climbed again until 1951. Though the summit can be gained by approaching from the west, the easiest access is from the east, and the Blackfeet tribe may issue access permits to cross reservation lands. This entire area is sacred to the Blackfeet Native Americans. National Park Service visitor centers at St. Mary, Montana and at Many Glacier have additional information available.\n\n\n== See also ==\n\nRocky Mountains\nNinaki Mountain\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Sacred to Blackfoot tribes. Blackfoot name: Ninaistako. Classic example of a klippe."
    },
    {
      "name": "Ninaki Peak",
      "lat": 48.9252,
      "lon": -113.6248,
      "elevation": 8284,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Chief_Mountain",
      "wikipedia_text": "Chief Mountain (Blackfoot: Ninaistako) (9,085 feet or 2,769 metres) is located in the U.S. state of Montana on the eastern border of Glacier National Park and the Blackfeet Indian Reservation. The mountain is one of the most prominent peaks and rock formations along the Rocky Mountain Front, a 200-mile-long (320 km) overthrust fault, known as the Lewis Overthrust, which extends from central Montana into southern Alberta, Canada.\n\n\n== Geology ==\nChief Mountain is an example of a klippe. It consists of a Precambrian block which rests directly above much younger Cretaceous gray shales. The 1450-1400 million year old Precambrian rocks are 1300-1400 million years older than the Cretaceous rocks at the base of the mountain.\nHaving an older layer of rock juxtaposed atop younger basement rocks is found on occasion in thrust faults and is commonplace along the Lewis Overthrust which extends from central Montana to far southern Alberta. The surrounding portion of the thrust sheet has been removed by erosion leaving behind this and a few other isolated blocks of Proterozoic rock.\n\n\n== History and significance ==\nChief Mountain has been a sacred mountain to the tribes of Native Americans in the United States and First Nations in Canada for hundreds of years. The Blackfoot name for the mountain is Nínaiistáko. The peak is easily seen from Montana and Alberta due to the rapid 5,000-foot (1,500 m) altitude gain over the Great Plains which are immediately east of the mountain.\nThe mountain was seen by white explorers in the late 18th century and was known as \"Kings Peak\" on maps produced in the United Kingdom in 1795. In the early 1900s as white settlers came to the area, they observed native burial sites scattered along the base of the mountain. The name was changed in the late 19th century in reflection of Blackfeet naming of the mountain which was \"Great Chief\". When Glacier National Park was created in 1910, the summit and most prominent eastern slopes of the mountain were located within the park, leaving only the lower slopes within Blackfeet Indian Reservation.\nNatives from all over North America travel to the base of the mountain for sweet grass ceremonies, placing of prayer flags and other religious rites. Elders from Southern Alberta's Siksika Band (where the Great Chief Crowfoot hailed from) and other First Nation groups have an oral tradition that near the end of days, a Great White God would appear from the top of Chief Mountain and upon his departure, the mountain would crumble and be destroyed.\n\n\n== Climbing ==\nThe eastern face of the mountain rises over 1,500 ft (460 m) vertically and the easiest route on this section is rated class 4 by mountaineers. The rock is also primarily sedimentary and provides poor anchor points, which in turn is a contributing factor to the difficulty rating. Henry Stimson and two other explorers, including a Blackfeet Indian, climbed the difficult eastern face on September 8, 1892, and this is the first known ascent of the peak by white explorers. Upon the summit, Stimson's party observed ceremonial remains including bison skulls that had been left behind by Native Americans. The eastern face of the peak was not successfully climbed again until 1951. Though the summit can be gained by approaching from the west, the easiest access is from the east, and the Blackfeet tribe may issue access permits to cross reservation lands. This entire area is sacred to the Blackfeet Native Americans. National Park Service visitor centers at St. Mary, Montana and at Many Glacier have additional information available.\n\n\n== See also ==\n\nRocky Mountains\nNinaki Mountain\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Adjacent to Chief Mountain. Ninaki means &#x27;chief&#x27; in Blackfoot."
    },
    {
      "name": "Logging Mountain",
      "lat": 48.80581,
      "lon": -114.0472,
      "elevation": 8566,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Logging_Mountain",
      "wikipedia_text": "Logging Mountain (8,570 feet (2,612 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Logging Mountain rises more than 4,700 feet (1,400 m) above Logging Lake.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rises more than 4,700 feet above Logging Lake."
    },
    {
      "name": "Vulture Peak",
      "lat": 48.83719,
      "lon": -114.0239,
      "elevation": 9638,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Vulture_Peak_(Montana)",
      "wikipedia_text": "Vulture Peak (9,642 feet (2,939 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. The Vulture Glacier is located on the southern flanks of the mountain, while the Two Ocean Glacier is immediately to the north. Vulture Peak is the thirteenth highest summit in Glacier National Park.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Thirteenth highest summit. Vulture Glacier on southern flanks; Two Ocean Glacier to the north."
    },
    {
      "name": "Square Peak",
      "lat": 48.86638,
      "lon": -114.10441,
      "elevation": 8777,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Square_Peak",
      "wikipedia_text": "Square Peak (8,781 feet (2,676 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Square Peak is .63 miles (1.01 km) SSW of Rainbow Peak.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Just over half a mile from Rainbow Peak."
    },
    {
      "name": "Redhorn Peak",
      "lat": 48.86497,
      "lon": -114.00625,
      "elevation": 8128,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Redhorn_Peak",
      "wikipedia_text": "Redhorn Peak (8,128 feet (2,477 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Redhorn Peak is situated along the Continental Divide.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Situated along the Continental Divide."
    },
    {
      "name": "West Flattop Mountain",
      "lat": 48.85048,
      "lon": -113.91155,
      "elevation": 6830,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Nahsukin Mountain",
      "lat": 48.84101,
      "lon": -113.98932,
      "elevation": 8194,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Nahsukin_Mountain",
      "wikipedia_text": "Nahsukin Mountain (8,194 feet (2,498 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Nahsukin Mountain is situated along the Continental Divide. \"Nahsukin\" is Kootenai for \"chief\".\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "&#x27;Nahsukin&#x27; is Kootenai for &#x27;chief.&#x27; On the Continental Divide."
    },
    {
      "name": "Trapper Peak",
      "lat": 48.81404,
      "lon": -113.95647,
      "elevation": 7702,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Mount Geduhn",
      "lat": 48.79654,
      "lon": -113.97024,
      "elevation": 8375,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Geduhn",
      "wikipedia_text": "Mount Geduhn (8,379 feet (2,554 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. The mountain is named for Frank Geduhn, an early pioneer who had cabins for visitors at the head of Lake McDonald prior to 1900, and who guided Sperry parties on some of their trips into the area.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nFrank Geduhn photo: Billingsgazette.com",
      "summary": "Named for Frank Geduhn, early pioneer who guided Sperry parties before 1900."
    },
    {
      "name": "Anaconda Peak",
      "lat": 48.76811,
      "lon": -113.97353,
      "elevation": 8279,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Anaconda_Peak",
      "wikipedia_text": "Anaconda Peak (8,279 feet (2,523 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana, to the southeast of the eastern reaches of Logging Lake.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Southeast of the eastern reaches of Logging Lake."
    },
    {
      "name": "Swiftcurrent Mountain",
      "lat": 48.78558,
      "lon": -113.76701,
      "elevation": 8436,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Swiftcurrent_Mountain",
      "wikipedia_text": "Swiftcurrent Mountain (8,440 feet; 2,573 m) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Swiftcurrent Mountain is situated along the Continental Divide. The historic Swiftcurrent Fire Lookout is at the top of the mountain.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Historic Swiftcurrent Fire Lookout sits atop this Continental Divide summit."
    },
    {
      "name": "Iceberg Peak",
      "lat": 48.81439,
      "lon": -113.75998,
      "elevation": 9146,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Iceberg_Peak_(Montana)",
      "wikipedia_text": "Iceberg Peak (9,149 feet (2,789 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Iceberg Peak rises more than 3,000 feet (910 m) above Iceberg Lake and is considered a difficult climb due to the steepness and exposure climbers must endure. The peak sits astride the continental divide 1.1 mi (1.8 km) WNW of Mount Wilbur.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rises 3,000 feet above Iceberg Lake. Considered difficult to climb due to steepness and exposure."
    },
    {
      "name": "Ahern Peak",
      "lat": 48.83066,
      "lon": -113.78231,
      "elevation": 8749,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Ahern_Peak",
      "wikipedia_text": "Ahern Peak (8,753 feet (2,668 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The mountain was named after George Patrick Ahern.  Ahern Peak is immediately southwest of Helen Lake and straddles the Continental Divide. Ahern Glacier lies just north of the peak.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named after George Patrick Ahern. Straddles Continental Divide with Ahern Glacier to the north."
    },
    {
      "name": "Cathedral Peak",
      "lat": 48.86912,
      "lon": -113.86609,
      "elevation": 9041,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Cathedral_Peak_(Montana)",
      "wikipedia_text": "Cathedral Peak (9,045 feet (2,757 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Shepard Glacier is situated immediately southeast of the peak.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Shepard Glacier lies immediately southeast."
    },
    {
      "name": "Pyramid Peak",
      "lat": 48.87344,
      "lon": -113.83097,
      "elevation": 8080,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Pyramid_Peak_(Montana)",
      "wikipedia_text": "Pyramid Peak (8,200–8,280 feet (2,499–2,524 m)) is in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mokowanis Lake lies just northeast of the peak, and Atsina Lake is to the west.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Mokowanis Lake lies to the northeast, Atsina Lake to the west."
    },
    {
      "name": "Mount Kipp",
      "lat": 48.85611,
      "lon": -113.84081,
      "elevation": 8839,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Kipp",
      "wikipedia_text": "Mount Kipp (8,844 feet (2,696 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Immediately east of the summit lies the retreating Chaney Glacier. Mount Kipp is situated along the Continental Divide. The mountain is presumed to have been named for Joe Kipp, a half-breed Indian trapper and scout who tried to prevent the Marias Massacre.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Joe Kipp, half-Blackfoot trapper who tried to prevent the Marias Massacre. Chaney Glacier lies east."
    },
    {
      "name": "Mount Merritt",
      "lat": 48.87016,
      "lon": -113.78649,
      "elevation": 10004,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Merritt",
      "wikipedia_text": "Mount Merritt (10,009 feet (3,051 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The peak is one of six in Glacier National Park that rise over 10,000 feet (3,048 m). Located in the northeastern part of the park, Mount Merritt rises dramatically a vertical mile above nearby rivers. The approach to this remote peak involves a one way hike of 13 miles (21 km) to the summit base. Near the summit, the Old Sun Glacier hangs along the east ridge. The summit is named for General Wesley Merritt in 1891 by members of Troop C, 1st Cavalry who were visiting the region while stationed at Fort Assiniboine.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "One of six peaks over 10,000 feet. Named for General Wesley Merritt. Old Sun Glacier on east ridge."
    },
    {
      "name": "Natoas Peak",
      "lat": 48.87482,
      "lon": -113.76318,
      "elevation": 9476,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Natoas_Peak",
      "wikipedia_text": "Natoas Peak (9,480 feet (2,890 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Natoas Peak is 1.10 miles (1.77 km) northeast of Mount Merritt.\nFirst ascent by Bruce Murphy and Bill Mathews, August 1964.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "About a mile northeast of Mount Merritt. First non-native ascent by Murphy and Mathews in 1964."
    },
    {
      "name": "Ipasha Peak",
      "lat": 48.85155,
      "lon": -113.78685,
      "elevation": 9572,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Ipasha_Peak",
      "wikipedia_text": "Ipasha Peak (9,577 feet (2,919 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Ipasha Peak is 1.29 miles (2.08 km) south of Mount Merritt and is in the northeastern section of Glacier National Park. Ahern Glacier is located on the southeastern slopes of the mountain while the Ipasha Glacier is to the southwest of the peak. Helen Lake lies almost 4,500 feet (1,400 m) below the summit of Ipasha Peak to the southeast.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Ipasha Peak",
      "summary": "Between Mount Merritt and Helen Lake. Ahern Glacier on southeast slopes; Ipasha Glacier to southwest."
    },
    {
      "name": "Seward Mountain",
      "lat": 48.87069,
      "lon": -113.68061,
      "elevation": 8917,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Seward_Mountain_(Montana)",
      "wikipedia_text": "Seward Mountain (8,917 feet (2,718 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Connects Yellow Mountain ridge to the east."
    },
    {
      "name": "Apikuni Mountain",
      "lat": 48.83615,
      "lon": -113.65427,
      "elevation": 9068,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Apikuni_Mountain",
      "wikipedia_text": "Apikuni Mountain (9,073 feet (2,765 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named from the Blackfoot language."
    },
    {
      "name": "Crowfeet Mountain",
      "lat": 48.83708,
      "lon": -113.69656,
      "elevation": 8914,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Crowfeet_Mountain",
      "wikipedia_text": "Crowfeet Mountain (8,914 feet (2,717 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Crowfeet Mountain is situated on a ridgeline just south of the Ptarmigan Tunnel and is easily seen from Iceberg Lake to the southwest.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "On ridgeline south of Ptarmigan Tunnel. Easily seen from Iceberg Lake."
    },
    {
      "name": "Mount Henkle",
      "lat": 48.82151,
      "lon": -113.68346,
      "elevation": 8770,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Henkel",
      "wikipedia_text": "Mount Henkel (8,774 feet (2,674 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Kennedy Lake is just to the north of the mountain.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Kennedy Lake lies just to the north."
    },
    {
      "name": "Mount Wilbur",
      "lat": 48.80566,
      "lon": -113.73939,
      "elevation": 9321,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Wilbur_(Montana)",
      "wikipedia_text": "Mount Wilbur (9,326 feet (2,843 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Plainly visible from the region of Many Glacier, the peak rises over 4,500 feet (1,372 m) above Swiftcurrent Lake and is a steep pyramid on three sides. The west slopes of the peak join to ridges along the continental divide. Much of the climbing routes are rated at class 4 to 5, with some only used once. The sedimentary rock of the mountains makes for often poor anchoring points and enhances the difficulty. A cirque on the north slopes of the mountain shelters Iceberg Lake, a popular hiking destination from Many Glacier. The mountain was named by George Bird Grinnell in 1885, for Edward R. Wilbur of New York, one of Grinnell's partners in the Forest and Stream Publishing Company (forerunner of Field & Stream magazine), and both men were founders of the Audubon Society.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period. The bulk of the peak is composed of limestone of the Siyeh Formation, and the conspicuous dark band is a diorite sill.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Steep pyramid on three sides rising 4,500 feet above Swiftcurrent Lake. Named by Grinnell for Audubon Society co-founder."
    },
    {
      "name": "Altyn Peak",
      "lat": 48.81325,
      "lon": -113.65637,
      "elevation": 7947,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Altyn_Peak",
      "wikipedia_text": "Altyn Peak (7,951 feet; 2,423 m) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Altyn Peak is situated just north of Swiftcurrent Lake and the Many Glacier Hotel and is easily seen from both locations. The peak is named after Dave Greenwood Altyn who was a financial backer of a local mine in the late 1800s; the mining town of Altyn was at the junction of Canyon Creek and Swiftcurrent Lake. The peak was known as Crow Feet Mountain after the last chief of the Blackfeet confederacy of tribes.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for mining town financial backer. Formerly called Crow Feet Mountain after the last Blackfeet chief."
    },
    {
      "name": "Mount Grinnell",
      "lat": 48.77651,
      "lon": -113.727,
      "elevation": 8851,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Grinnell",
      "wikipedia_text": "Mount Grinnell is a peak located in the heart of Glacier National Park in the U.S. state of Montana. Lying just east of the Continental Divide in the Many Glacier region of the park, the peak is flanked to the northwest by Swiftcurrent Glacier and to the south by Grinnell Glacier. Mount Grinnell is named after George Bird Grinnell. From the Many Glacier Hotel on Swiftcurrent Lake, the eastern arm of Mount Grinnell, known as Grinnell Point, hides the main summit.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\n\"Mount Grinnell\". SummitPost.org.",
      "summary": "Named for George Bird Grinnell. Flanked by Swiftcurrent and Grinnell Glaciers."
    },
    {
      "name": "Grinnell Point",
      "lat": 48.78738,
      "lon": -113.68555,
      "elevation": 7600,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Grinnell_Point",
      "wikipedia_text": "Mount Grinnell\n\nGrinnell Point (7,604 feet (2,318 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Grinnell Point is an oft-photographed mountain, situated conspicuously just west of Swiftcurrent Lake across from the Many Glacier Hotel. Grinnell Point is a subpeak of Mount Grinnell, which lies .21 mi (0.34 km) to the west-southwest and is oftentimes misidentified as Mount Grinnell since that summit cannot be seen from the roads in the Many Glacier region. Grinnell Point is named for George Bird Grinnell.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Oft-photographed subpeak of Mount Grinnell, often mistaken for its parent summit."
    },
    {
      "name": "Allen Mountain",
      "lat": 48.75795,
      "lon": -113.65759,
      "elevation": 9376,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Allen_Mountain_(Montana)",
      "wikipedia_text": "Allen Mountain (9,381 ft (2,859 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\nAllen Mountain is NNW of Cracker Lake.  The mountain is named to honor Cornelia Seward Allen, the granddaughter of President Abraham Lincoln's Secretary of State William H. Seward Sr. The mountain was named in 1891 by a party of explorers headed by George Bird Grinnell that included Cornelia's brother, William Henry Seward III, a Yale University classmate of Grinnell.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Gallery ==\n\n\n== References ==",
      "summary": "Named for Cornelia Seward Allen, granddaughter of Lincoln&#x27;s Secretary of State. Named by George Bird Grinnell in 1891."
    },
    {
      "name": "Wynn Mountain",
      "lat": 48.77593,
      "lon": -113.59895,
      "elevation": 8404,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Wynn_Mountain",
      "wikipedia_text": "Wynn Mountain (8,409 feet (2,563 m)) is located in the Lewis Range of Glacier National Park, in the U.S. state of Montana. Wynn Mountain rises above the south shores of Lake Sherburne. The mountain is named for Frank B. Wynn, physician and scientist who was killed while attempting to climb nearby Mount Siyeh on July 27, 1927.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for physician Frank B. Wynn, killed attempting Mount Siyeh in 1927."
    },
    {
      "name": "Wolf Gun Mountain",
      "lat": 48.74924,
      "lon": -113.9945,
      "elevation": 8000,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Longfellow Peak",
      "lat": 48.74524,
      "lon": -113.93865,
      "elevation": 8904,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Longfellow_Peak",
      "wikipedia_text": "Longfellow Peak (8,904 feet (2,714 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Longfellow Peak is immediately north of Paul Bunyans Cabin, a rock formation that resembles a log cabin from a distance. Lake Evangeline is northeast of the peak and Ruger Lake is to the east. The mountain was named by R. H. Sargent, topographer for the US Geological Survey in the early mapping of Glacier Park, to honor the American poet Henry Wadsworth Longfellow, (1807–1882).\n\n\n== Climate ==\nBased on the Köppen climate classification, Longfellow Peak is located in a subarctic climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Gallery ==\n\n\n== References ==",
      "summary": "Named for poet Henry Wadsworth Longfellow. Adjacent to Paul Bunyans Cabin rock formation."
    },
    {
      "name": "Paul Bunyans Cabin",
      "lat": 48.74106,
      "lon": -113.93645,
      "elevation": 8490,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Paul_Bunyans_Cabin",
      "wikipedia_text": "Paul Bunyans Cabin (8,490 feet (2,588 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Paul Bunyans Cabin is on a rock spur immediately SSE of Longfellow Peak and from certain angles appears as a Log cabin. Lake Evangeline is northeast of the peak and Ruger Lake is to the east.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rock formation resembling a log cabin when viewed from certain angles."
    },
    {
      "name": "Rogers Peak",
      "lat": 48.68651,
      "lon": -113.93723,
      "elevation": 7320,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Stanton Mountain",
      "lat": 48.65987,
      "lon": -113.89412,
      "elevation": 7750,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Stanton_Mountain",
      "wikipedia_text": "Stanton Mountain is a 7,750 feet (2,360 m) mountain summit located in the Livingston Range, of Glacier National Park in the U.S. state of Montana. Stanton Mountain rises more than 4,500 feet (1,400 m) above the northern shore of Lake McDonald. The mountain's name refers to Mrs. Lottie Stanton who lived near the west side of the park in the late 1800s, and with her husband operated a livery stable in  historic Demersville. She was a pioneering woman who followed the construction camps during the railroad building days. The mountain's name was officially adopted in 1929. In the late 1800s it was known as Mt. Lottie Stanton. The nearest higher peak is Mount Vaught, 1.38 miles (2.22 km) to the northeast. Precipitation runoff from the mountain drains into tributaries of the Flathead River.\n\n\n== Climate ==\nBased on the Köppen climate classification, Stanton Mountain is located in a subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Stanton Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== Gallery ==\n\n\n== References ==\n\n\n== External links ==\nNational Park Service web site: Glacier National Park\nLake McDonald web cam with Stanton on the left: National Park Service\nStanton Mountain weather: Mountain Forecast",
      "summary": "Named for pioneering woman Lottie Stanton who ran a livery stable in early Demersville."
    },
    {
      "name": "McPartland Mountain",
      "lat": 48.69064,
      "lon": -113.8643,
      "elevation": 8413,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/McPartland_Mountain",
      "wikipedia_text": "McPartland Mountain (8,417 feet (2,566 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. McPartland Mountain is a little more than a mile south of Heavens Peak. The mountain's name is believed to refer to Frank McPartland, of eastern Montana, who worked around nearby Lake McDonald for two seasons, and drowned in a boating accident on the lake in the 1890s.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nMcPartland Mountain (centered in photo): Flickr",
      "summary": "Named for Frank McPartland who drowned in Lake McDonald in the 1890s."
    },
    {
      "name": "Heavens Peak",
      "lat": 48.70836,
      "lon": -113.85656,
      "elevation": 8987,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Heavens_Peak",
      "wikipedia_text": "Heavens Peak (8,991 feet (2,740 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Heavens Peak is a little more than 1 mile (1.6 km) north of McPartland Mountain. The mountain's descriptive name first appeared on a map prepared by Lt. George P. Ahern, from 1888 to 1890 reconnaissance maps prepared by him. This geographical feature's name was officially adopted in 1929 by the United States Board on Geographic Names.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F (−23 °C) with wind chill factors below −30 °F (−34 °C).\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\n\nWeather forecast: Heavens Peak",
      "summary": "Descriptive name first appeared on Lt. George Ahern&#x27;s 1888-1890 reconnaissance maps."
    },
    {
      "name": "Mount Vaught",
      "lat": 48.68058,
      "lon": -113.87463,
      "elevation": 8850,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Vaught",
      "wikipedia_text": "Mount Vaught (8,854 feet (2,699 m)) is located in the Livingston Range, Glacier National Park in the U.S. state of Montana. Mount Vaught is just over 2 miles (3.2 km) SSW of Heavens Peak. The mountain is named for Lawrence O. Vaught, a lawyer from Jacksonville, Illinois, who spent many of his summers in Glacier Park and corresponded with George Bird Grinnell, who named many of the features in the park.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nNational Park Service web site: Glacier National Park\nMount Vaught weather: Mountain Forecast",
      "summary": "Named for Illinois lawyer Lawrence Vaught who summered here and corresponded with George Bird Grinnell."
    },
    {
      "name": "Mount Cannon",
      "lat": 48.69248,
      "lon": -113.77488,
      "elevation": 8952,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Cannon",
      "wikipedia_text": "Mount Cannon (8,956 feet (2,730 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  Formerly called Goat Mountain it was renamed for the leading physiologist Dr. Walter Bradford Cannon and his wife Cornelia, who made the first recorded ascent of the mountain in 1901.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Cannon is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, Cannon is located in a subarctic climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== Gallery ==",
      "summary": "Named for physiologist Dr. Walter Bradford Cannon and wife Cornelia, who made first ascent in 1901."
    },
    {
      "name": "Bearhat Mountain",
      "lat": 48.66701,
      "lon": -113.76378,
      "elevation": 8684,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Bearhat_Mountain",
      "wikipedia_text": "Bearhat Mountain (8,689 feet (2,648 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Bearhat Mountain is immediately west of Hidden Lake. The mountain was named after a Kootenai Native American, and was officially adopted by the U.S. Board on Geographic Names in 1932.\nBased on the Köppen climate classification, Bearhat Mountain has an alpine climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Bearhat Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\n\nGeology of the Rocky Mountains\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Gallery ==\n\n\n== References ==\n\n\n== External links ==\nBearhat Mountain: Weather",
      "summary": "Named after a Kootenai person. Sits west of Hidden Lake."
    },
    {
      "name": "Mount Brown",
      "lat": 48.63796,
      "lon": -113.81914,
      "elevation": 8565,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Brown_(Flathead_County,_Montana)",
      "wikipedia_text": "Mount Brown (8,569 feet (2,612 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\nThere are conflicting claims about who Mount Brown was named after.  A US Park Service publication states it was: \"named for William Brown of Chicago, then Solicitor General for the Chicago and Alton Railroad, by some members of his party on a camping and fishing trip to the area around Lake McDonald in 1894. The companions, Charles H. Russell (not the artist) and Frank A. Johnson, climbed this mountain that arose back of their camp, and so named it.\"  However this naming story does not explain how the campers were able make their naming decision known to the public. The 1929 US Geographic Board decision card states that the Board accepted the name Mount Brown in accordance with existing local usage, and states that it was probably named for Louis Brown, a Montana pioneer.\nBelow the summit on the southwestern slopes of Mount Brown is the historic Mount Brown Fire Lookout which was built in 1928 and is listed on the National Register of Historic Places..\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Historic 1928 fire lookout on southwestern slopes is listed on the National Register of Historic Places."
    },
    {
      "name": "Little Matterhorn",
      "lat": 48.63564,
      "lon": -113.78515,
      "elevation": 7886,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Little_Matterhorn_(Montana)",
      "wikipedia_text": "Little Matterhorn is a 7,886-foot (2,404 meter) elevation mountain summit located in the Lewis Range, of Glacier National Park in the U.S. state of Montana. The nearest higher peak is Edwards Mountain, 0.9 miles (1.4 km) to the south. Precipitation runoff from the mountain drains into creeks which empty into Lake McDonald.\nBased on the Köppen climate classification, Little Matterhorn has an alpine climate characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Little Matterhorn is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nGeology of the Rocky Mountains\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Gallery ==\n\n\n== References ==\n\n\n== External links ==\nLake McDonald web cam with Little Matterhorn on the right: National Park Service\nLittle Matterhorn: Weather\nClimbing Little Matterhorn: YouTube",
      "summary": "Distinctive pyramidal summit. Drainage flows to Lake McDonald."
    },
    {
      "name": "Mount Siyeh",
      "lat": 48.72864,
      "lon": -113.64987,
      "elevation": 10014,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Siyeh",
      "wikipedia_text": "Mount Siyeh, with a height of 10,019 feet (3,054 m), is the fifth tallest and one of six peaks over 10,000 feet (3,048 m) in Glacier National Park, Montana, United States. Mount Siyeh was named after a Blackfeet Native American, Sai-yeh, whose name means \"Crazy Dog\" or \"Mad Wolf.\"\nMount Siyeh stands about two miles east of the Continental Divide, within the watershed of the Saint Mary River, which drains into the Saskatchewan River, and ultimately into Hudson Bay.\nMount Siyeh is rather easily accessible from a variety of different routes.  It can be ascended via a long scree scramble from the Preston Park area, or from Piegan Pass via Cataract Mountain.  The summit can also be reached via a long hiking/mountaineering route dubbed the \"Skyline Experience\"; this route starts from the Many Glacier Hotel and involves 5.5 miles (9 km) ridge walk and includes the summits of Wynn Mountain (8,404 feet (2,562 m)) and Cracker Peak (9,833 feet (2,997 m)) before reaching the top of Siyeh.\n\nRoute Descriptions can be found on Summitpost or in A Climbers Guide to Glacier National Park.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\nThe peak of Mount Siyeh has a tundra climate (Köppen ET) or an Alpine climate.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Fifth tallest peak. Named after Blackfeet &#x27;Sai-yeh&#x27; meaning &#x27;Crazy Dog&#x27; or &#x27;Mad Wolf.&#x27;"
    },
    {
      "name": "Cataract Mountain",
      "lat": 48.72481,
      "lon": -113.6813,
      "elevation": 8180,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Cataract_Mountain",
      "wikipedia_text": "Cataract Mountain (8,180 feet (2,493 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Cataract Mountain is .70 miles (1.13 km) NNE of Piegan Mountain and more than a mile west of Mount Siyeh.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Between Piegan Mountain and Mount Siyeh."
    },
    {
      "name": "Bishops Cap",
      "lat": 48.72471,
      "lon": -113.70964,
      "elevation": 9127,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Bishops_Cap",
      "wikipedia_text": "Bishops Cap (9,127 feet (2,782 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Located above the Garden Wall and straddling the Continental Divide, when viewed from the south at Logan Pass, the peak appears to resemble a Bishop's headwear. The name Bishops Cap is descriptive only. The name has no known origin.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Bishops Cap is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Bishops Cap is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Resembles bishop&#x27;s headwear when viewed from Logan Pass. Part of the Garden Wall."
    },
    {
      "name": "Mount Gould",
      "lat": 48.74261,
      "lon": -113.71508,
      "elevation": 9553,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Gould",
      "wikipedia_text": "Mount Gould could be:\n\nMount Gould (Montana) in Glacier National Park, United States\nMount Gould (California) in Sierra Nevada, United States\nMount Gould (Plymouth), a suburb in Plymouth, Devon, England\nMount Gould (Tasmania) in the Cradle Mountain-Lake St Clair National Park, Australia\nMount Gould (Antarctica)\nMount Gould Station, a pastoral lease in the Mid West of Western Australia",
      "summary": "Part of the Garden Wall along the Continental Divide."
    },
    {
      "name": "Pollock Mountain",
      "lat": 48.71653,
      "lon": -113.70297,
      "elevation": 9190,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Pollock_Mountain",
      "wikipedia_text": "Pollock Mountain (9,195 feet (2,803 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  Pollock Mountain is situated along the Continental Divide and is one of the peaks along the Garden Wall and is approximately .6 miles (0.97 km) south of Bishops Cap. The mountain was named by Ross Carter for William C. Pollock, a member of the Indian Commission who along with Walter M. Clements and George Bird Grinnell negotiated with the Blackfeet to consummate the treaty that enabled the Federal Government to purchase the \"Ceded Strip\" of land, which included all of what is now Glacier National Park to the east of the Continental Divide.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for William Pollock who negotiated the Blackfeet treaty creating the eastern park."
    },
    {
      "name": "Mount Clements",
      "lat": 48.69256,
      "lon": -113.74105,
      "elevation": 8760,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Clements_Mountain",
      "wikipedia_text": "Clements Mountain (8,765 feet (2,672 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Clements Mountain rises to the west of Logan Pass and above the Hidden Lake Trail which leads to Hidden Lake just west of the continental divide. The peak was named after Walter M. Clements who had worked to set up a treaty between the Blackfeet and the U.S. Government for the purchase of tribal lands east of the continental divide which later became part of the park.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Clements Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\n\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nClements Mountain: Weather",
      "summary": "Named for Walter Clements who helped negotiate Blackfeet land purchase. West of Logan Pass."
    },
    {
      "name": "Mount Reynolds",
      "lat": 48.67162,
      "lon": -113.72381,
      "elevation": 9125,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Reynolds_Mountain",
      "wikipedia_text": "Reynolds Mountain (9,125 feet (2,781 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  Reynolds Mountain is situated along the Continental Divide and is easily seen from Logan Pass by looking due south from the pass. Hidden Lake is located below Reynolds Mountain to the west. Reynolds is a class 2(3) climb via the southwestern talus slope route that allows many people to easily climb the peak. The mountain was named for Charles E. Reynolds, a writer for Forest and Stream magazine, and assistant to the magazine's editor, George Bird Grinnell, who named many of the features in Glacier National Park. The mountain's name was officially adopted in 1910 by the U.S. Board on Geographic Names.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Reynolds Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nReynolds Mountain: Weather",
      "summary": "Easily seen from Logan Pass. Named for Forest and Stream writer Charles Reynolds."
    },
    {
      "name": "Mount Oberlin",
      "lat": 48.70429,
      "lon": -113.73663,
      "elevation": 8180,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Oberlin",
      "wikipedia_text": "Mount Oberlin (8,184 feet (2,494 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Oberlin is just northwest of Logan Pass. Below the summit to the northwest, water and melting snow off Mount Oberlin lead to the 492 feet (150 m) Bird Woman Falls, one of the tallest waterfalls in Glacier National Park.\nDr. Lyman B. Sperry, a member of an 1895 party exploring the Glacier Park region, named the mountain after his employer, Oberlin College.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named by Dr. Lyman Sperry for Oberlin College. Source of 492-foot Bird Woman Falls."
    },
    {
      "name": "Piegan Mountain",
      "lat": 48.71031,
      "lon": -113.68922,
      "elevation": 9220,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Piegan_Mountain",
      "wikipedia_text": "Piegan Mountain (9,225 feet (2,812 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  Piegan Glacier is located in a cirque immediately southeast of the summit.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Piegan Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nNational Park Service web site: Glacier National Park\nPiegan Mountain weather: Mountain Forecast",
      "summary": "Piegan Glacier sits in a cirque on the southeast."
    },
    {
      "name": "Matahpi Peak",
      "lat": 48.70645,
      "lon": -113.63913,
      "elevation": 9365,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Matahpi_Peak",
      "wikipedia_text": "Matahpi Peak (9,370 feet (2,856 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Below the summit of Matahpi Peak lies Sexton Glacier. Going-to-the-Sun Mountain is just over 1 mile (1.6 km) to the south of Matahpi Peak.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Matahpi Peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Sexton Glacier lies below. A mile north of Going-to-the-Sun Mountain."
    },
    {
      "name": "Going-to-the-Sun Mountain",
      "lat": 48.69037,
      "lon": -113.63669,
      "elevation": 9642,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Going-to-the-Sun_Mountain",
      "wikipedia_text": "Going-to-the-Sun Mountain is a 9,647-foot (2,940 m) mountain peak located in Glacier National Park in the U.S. state of Montana. It rises dramatically above St. Mary Valley just north of the Going-to-the-Sun Road. The mountain was named by James Willard Schultz in 1888.\n\n\n== Origin of name ==\nDuring the winter of 1887–1888, James Willard Schultz, an early hunting guide in the St. Mary Lakes region, and his family built a cabin on the north shore of upper Saint Mary Lake.  While hunting on Red Eagle Mountain with his Pikuni friend, Tail-Feathers-Coming-Over-the-Hill, Schultz gave this mountain the name it bears today.  Warren Hanna, Schultz's biographer describes the naming thus:\n\nIt was during this winter that Schultz and Tail-Feathers-Coming-Over-the-Hill killed a bighorn ram on Red Eagle Mountain.  When they finished butchering it, they build a small fire and sat down beside it for a leisurely smoke. As they took turns puffing on Tail-Feather's long-stemmed black stone pipe, Schultz noticed that his friend was gazing constantly at a particularly beautiful mountain across the lake.  Finally, he commented to Schultz: How very high it is, its summit far up into the blue.  Of all the mountains that I have ever seen I think it is the most beautiful.  Were I younger and were it summertime, how I would like to climb up and lie on its summit, and fast, and pray Sun for a vision. Schultz, too, had admired that particular peak and had considered it the finest in the area.  Often he had tried to think of a name for it that would be fitting, and now Tail-Feathers had given him an idea.  The mountain should have some relationship to Sun, the most important of all the gods of the Blackfoot tribe.  After pondering the matter for a while, Schultz turned to Tail-Feathers and said: We will name that mountain.  Let us call it Going-to-the-Sun Mountain. With which suggestion Tail-Feathers was in complete accord, saying Good, That is a powerful, sacred name; it could not have a better one.\nAlternatively, numerous Blackfeet Indian legends are credited with the origins of the mountains' name. Used by the Blackfeet as a location for vision quests, it is one of the most accessible major mountain peaks in Glacier National Park. According to several sources, the actual Blackfeet name for the mountain is The-Face-of-Sour-Spirit-Who-Went-Back-to-The-Sun-After-His-Work-Was-Done Mountain, in explanation of the snowfields on the mountainside which, as viewed from the west, make the outline of a face.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, the mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer. Precipitation runoff from the mountain drains into tributaries of the Saint Mary River.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Notes ==\n\n\n== Further reading ==\nEdwards, J. Gordon (1991). A Climbers Guide to Glacier National Park. Falcon. ISBN 0-87842-177-7.",
      "summary": "Named by James Willard Schultz in 1888. Rises dramatically above St. Mary Valley."
    },
    {
      "name": "Heavy Runner Mountain",
      "lat": 48.67684,
      "lon": -113.69492,
      "elevation": 8016,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Heavy_Runner_Mountain",
      "wikipedia_text": "Heavy Runner Mountain (8,016 feet (2,443 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The summit is a little over a mile east-northeast of Reynolds Mountain and is easily seen from the Going-to-the-Sun Road as well as Logan Pass. The mountain is named for the Blackfeet Indian Chief, Heavy Runner, who was massacred along with most of his encampment by Col. Eugene M. Baker's detachment on the Marias River on January 23, 1870.\n\n\n== Climate ==\nBased on the Köppen climate classification, Heavy Runner Mountain is located in a subarctic climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Heavy Runner Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== Gallery ==\n\n\n== External links ==\nWeather forecast: Heavy Runner Mountain",
      "summary": "Named for Blackfeet Chief Heavy Runner, killed in the 1870 Marias Massacre."
    },
    {
      "name": "Fusilade Mountain",
      "lat": 48.63989,
      "lon": -113.72323,
      "elevation": 8750,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Fusillade_Mountain",
      "wikipedia_text": "Fusillade Mountain (8,755 feet (2,669 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Fusillade Mountain lies immediately north of Gunsight Lake at the western terminus of the St. Mary Valley and can be seen from the Going-to-the-Sun Road. The mountain was named by George Bird Grinnell in 1891, \"as a satirical gesture at W. H. Seward and Henry L. Stimson for firing a futile volley at a group of goats on the side of this mountain\".\n\n\n== Geology ==\nLike the mountains in Glacier National Park, Fusillade is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nNational Park Service web site: Glacier National Park\nFusillade Mountain weather: Mountain Forecast",
      "summary": "Lies immediately west of Reynolds Mountain."
    },
    {
      "name": "Citadel Mountain",
      "lat": 48.63194,
      "lon": -113.65472,
      "elevation": 9030,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Citadel_Mountain",
      "wikipedia_text": "Citadel Mountain (9,035 feet or 2,754 meters) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The mountain is located at the western edge of Saint Mary Lake and is easily seen from the Going-to-the-Sun Road.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Easily seen from Going-to-the-Sun Road at western edge of Saint Mary Lake."
    },
    {
      "name": "Dusty Star Mountain",
      "lat": 48.65038,
      "lon": -113.63506,
      "elevation": 8084,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Dusty_Star_Mountain",
      "wikipedia_text": "Dusty Star Mountain (8,573 feet [2,613 m]) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Connected by an arête to Citadel Mountain to the south, Dusty Star Mountain lies to the south and across the Saint Mary Valley from Going-to-the-Sun Mountain. Dusty Star Mountain is easily seen from the Going-to-the-Sun Road, and often photographed by tourists taking pictures of Wild Goose Island which lies in the western section of Saint Mary Lake. The Blackfoot name for Dusty Star is iszika-kakatosi meaning \"meteor\" or \"smoking star\".\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nWeather: Dusty Star Mountain",
      "summary": "Blackfoot name &#x27;iszika-kakatosi&#x27; means &#x27;meteor.&#x27; Often photographed with Wild Goose Island."
    },
    {
      "name": "Little Chief Mountain",
      "lat": 48.64426,
      "lon": -113.59546,
      "elevation": 9541,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Little_Chief_Mountain",
      "wikipedia_text": "Little Chief Mountain (9,546 feet (2,910 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Little Chief Mountain is easily seen from the Going-to-the-Sun Road, rising to the south of Saint Mary Lake.  Little Chief Mountain was named in 1887 by George Bird Grinnell for his friend, Frank North, U.S. Army. \"Little Chief\" was his Pawnee name, given to him by his Pawnee Scouts.\n\n\n== Climate ==\nBased on the Köppen climate classification, Little Chief Mountain is located in a subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Little Chief Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nNational Park Service web site: Glacier National Park\nLittle Chief Mountain weather: Mountain Forecast",
      "summary": "Named by Grinnell for friend Frank North, whose Pawnee name was &#x27;Little Chief.&#x27;"
    },
    {
      "name": "Mahtotopa Mountain",
      "lat": 48.65161,
      "lon": -113.56995,
      "elevation": 8672,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mahtotopa_Mountain",
      "wikipedia_text": "Mahtotopa Mountain (8,677 feet (2,645 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mahtotopa Mountain rises to the south above Saint Mary Lake midway between Red Eagle Mountain and Little Chief Mountain and can be easily seen from the Going-to-the-Sun Road to the southwest of Rising Sun. Originally named Four Bears Mountain by George Bird Grinnell in 1885, the name was changed in 1932 to Mahtotopa. Mahtotopa is an incorrect spelling of \"Mato-tope\" which comes from Lakota, Mato Topa, the Mandan chief known as Four Bears. Mato-tope was a grandfather of Joe Kipp, a hunting companion of Grinnell.\n\n\n== Climate ==\nBased on the Köppen climate classification, Mahtotopa Mountain is located in a subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Mahtotopa Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Originally Four Bears Mountain. Named for Mandan chief Mato-tope, grandfather of Joe Kipp."
    },
    {
      "name": "Red Eagle Mountain",
      "lat": 48.65422,
      "lon": -113.54896,
      "elevation": 8881,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Red_Eagle_Mountain",
      "wikipedia_text": "Red Eagle Mountain (8,881 feet (2,707 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Red Eagle Mountain rises more than 4,000 ft (1,200 m) above Saint Mary Lake and is easily seen from the Going-to-the-Sun Road and the entrance to the park from the village of St. Mary, Montana as well as at Rising Sun. The mountain was named according to James Willard Schultz, \"by his Indian wife in 1887, for her uncle, Red Eagle, who had saved their son's life with his prayers to the Sun\".\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named by Schultz&#x27;s wife for her uncle Red Eagle, who saved their son&#x27;s life through prayer."
    },
    {
      "name": "Goat Mountain",
      "lat": 48.70455,
      "lon": -113.59178,
      "elevation": 8826,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Goat_Mountain_(Glacier_County,_Montana)",
      "wikipedia_text": "Goat Mountain (8,831 ft (2,692 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Goat  Mountain rises above Otokomi Lake and Goat Lake in the east central section of Glacier National Park.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F. Precipitation runoff from the mountain drains into Saint Mary Lake, thence the St. Mary River.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\nGoat Mountain to right of Saint Mary Lake (see file annotations)\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rises above Otokomi Lake and Goat Lake. Drains to Saint Mary Lake."
    },
    {
      "name": "Otokomi Mountain",
      "lat": 48.72493,
      "lon": -113.53638,
      "elevation": 7935,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Otokomi_Mountain",
      "wikipedia_text": "Otokomi Mountain (7,939 feet (2,420 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Named for George Bird Grinnell's part-Blackfoot hunting partner named Otokomi which means \"yellowfish'. Otokomi Mountain is north of the Rising Sun Auto Camp and Saint Mary Lake.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Grinnell&#x27;s Blackfoot hunting partner; &#x27;Otokomi&#x27; means &#x27;yellowfish.&#x27;"
    },
    {
      "name": "East Flattop Mountain",
      "lat": 48.73883,
      "lon": -113.52141,
      "elevation": 8356,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/East_Flattop_Mountain",
      "wikipedia_text": "East Flattop Mountain (8,361 feet (2,548 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. East Flattop Mountain rises to the north above Saint Mary Lake and is easily seen from the eastern entrance to the Going-to-the-Sun Road and the village of St. Mary, Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rises north of Saint Mary Lake. Visible from park&#x27;s eastern entrance."
    },
    {
      "name": "Singleshot Mountain",
      "lat": 48.74122,
      "lon": -113.49692,
      "elevation": 7926,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Singleshot_Mountain",
      "wikipedia_text": "Singleshot Mountain (7,930 feet (2,417 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The mountain is easily seen from Saint Mary, Montana and was named after the single-shot fired from a rifle by George Bird Grinnell when dispatching a Bighorn sheep while hunting for food in 1885 during park explorations. The sedimentary layers of the Appekunny Formation are clearly displayed on the southeastern cliffs of Singleshot Mountain.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Grinnell&#x27;s single shot dispatching a bighorn sheep while hunting in 1885."
    },
    {
      "name": "Curley Bear Mountain",
      "lat": 48.65882,
      "lon": -113.45615,
      "elevation": 8099,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Curly_Bear_Mountain",
      "wikipedia_text": "Curly Bear Mountain (8,099 feet (2,469 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Curly Bear Mountain is easily seen from the village of Saint Mary, Montana rising just west of Divide Mountain. The peak was named after Blackfoot warrior and historian Curly Bear (Kyáiyo-xusi).\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "East of Red Eagle Lake near the Triple Divide."
    },
    {
      "name": "Kakitos Mountain",
      "lat": 48.63204,
      "lon": -113.48933,
      "elevation": 7841,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Kakitos_Mountain",
      "wikipedia_text": "Kakitos Mountain (7,841 feet (2,390 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Kakitos Mountain is 1.63 miles (2.62 km) north of Medicine Owl Peak. Kakitos is the Blackfoot word for \"star\".\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "&#x27;Kakitos&#x27; is Blackfoot for &#x27;star.&#x27;"
    },
    {
      "name": "Divide Mountain",
      "lat": 48.66524,
      "lon": -113.40123,
      "elevation": 8665,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Divide_Mountain",
      "wikipedia_text": "Divide Mountain (8,670 feet (2,643 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Divide Mountain is located south of Saint Mary, Montana on the border of Glacier National Park and the Blackfeet Indian Reservation.\nDivide Mountain is also notable as the line parent of Mount Mitchell, North Carolina, which is the highest point in the Eastern United States.\n\n\n== See also ==\n\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "On the border of the park and Blackfeet Indian Reservation."
    },
    {
      "name": "White Calf Mountain",
      "lat": 48.64433,
      "lon": -113.40708,
      "elevation": 8893,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/White_Calf_Mountain",
      "wikipedia_text": "White Calf Mountain (8,898 feet (2,712 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. White Calf Mountain is south of Divide Mountain and just west of the Blackfeet Indian Reservation boundary.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "South of Divide Mountain, near Blackfeet Reservation boundary."
    },
    {
      "name": "Belton Hills",
      "lat": 48.52182,
      "lon": -113.93002,
      "elevation": 6339,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Edwards Mountain",
      "lat": 48.62254,
      "lon": -113.78749,
      "elevation": 9072,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Edwards_Mountain",
      "wikipedia_text": "Edwards Mountain (9,076 feet (2,766 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Edwards Mountain rises just to the west of Sperry Glacier. Based on the Köppen climate classification, Edwards Mountain has an alpine climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Edwards Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\nGunsight Mountain (left), Edwards Mountain, and Little Matterhorn (lower right) seen from Bearhat Mountain\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==",
      "summary": "Rises west of Sperry Glacier."
    },
    {
      "name": "Gunsight Mountain",
      "lat": 48.61908,
      "lon": -113.7541,
      "elevation": 9258,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Gunsight_Mountain_(Montana)",
      "wikipedia_text": "Gunsight Mountain (9,263 feet (2,823 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Gunsight Mountain is named after the adjacent Gunsight Pass, which was named by George Bird Grinnell in 1891.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Gunsight Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nGunsight Mountain: Weather forecast",
      "summary": "Named for adjacent Gunsight Pass, which Grinnell named in 1891."
    },
    {
      "name": "Lincoln Peak",
      "lat": 48.59702,
      "lon": -113.78408,
      "elevation": 7420,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": "Near Sperry Chalet overlooking Lake Ellen Wilson and Beaver Chief Falls."
    },
    {
      "name": "Mount Jackson",
      "lat": 48.60056,
      "lon": -113.72193,
      "elevation": 10052,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Jackson_(Montana)",
      "wikipedia_text": "Mount Jackson (10,052 feet (3,064 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Jackson is the fourth tallest mountain in Glacier National Park and it is situated on the Continental Divide. Both the mountain and its namesake Jackson Glacier are easily seen from the Going-to-the-Sun Road. Harrison Glacier, the park's largest remaining glacier, is located on the mountain's southern flank. Based on the Köppen climate classification, Mount Jackson has an alpine climate characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Mount Jackson is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\n\n\n== See also ==\n\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== Gallery ==\n\n\n== External links ==\nWeather forecast: Mount Jackson",
      "summary": "Fourth tallest in the park. Jackson Glacier easily seen from Going-to-the-Sun Road."
    },
    {
      "name": "Mount Logan",
      "lat": 48.60054,
      "lon": -113.64203,
      "elevation": 9239,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Logan_(Montana)",
      "wikipedia_text": "Mount Logan (9,244 feet (2,818 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Logan Glacier is immediately north of Mount Logan and Red Eagle Glacier lies to the east. Mount Logan is situated along the Continental Divide.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Logan Glacier to the north, Red Eagle Glacier to the east. On Continental Divide."
    },
    {
      "name": "Walton Mountain",
      "lat": 48.57541,
      "lon": -113.73298,
      "elevation": 8926,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Walton_Mountain",
      "wikipedia_text": "Walton Mountain (8,931 feet (2,722 m)) is in the Lewis Range, Glacier National Park in the U.S. state of Montana. Two unnamed hanging glaciers are located to the east and northeast of the summit. Mount Jackson is 1.8 miles (2.9 km) to the north-northeast.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Two unnamed hanging glaciers on east and northeast. Near Mount Jackson."
    },
    {
      "name": "Blackfoot Mountain",
      "lat": 48.58182,
      "lon": -113.66847,
      "elevation": 9574,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Blackfoot_Mountain",
      "wikipedia_text": "Blackfoot Mountain (9,579 ft (2,920 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. To the north of Blackfoot Mountain lies Blackfoot Glacier, one of the largest glaciers in the park. The stagnant Pumpelly Glacier is located to the immediate east and northeast of the mountain.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Blackfoot Glacier, one of the largest in the park, lies to the north."
    },
    {
      "name": "Mount Thompson",
      "lat": 48.5458,
      "lon": -113.68797,
      "elevation": 8727,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Thompson_(Montana)",
      "wikipedia_text": "Mount Thompson (8,531 feet (2,600 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Mount Stimson",
      "lat": 48.51422,
      "lon": -113.61028,
      "elevation": 10142,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Stimson",
      "wikipedia_text": "Mount Stimson (10,147 feet (3,093 m)) is the second highest peak in Glacier National Park, located in Montana, United States. It is part of the Lewis Range, which spans much of the park. It is located in the remote southwestern portion of the park, approximately 5 miles (8.0 km) west of the Continental Divide and 12 miles (19 km) southeast of Lake McDonald. It is drained by Pinchot Creek (on the south) and Nyack Creek (on the other sides), both of which flow into the Middle Fork of the Flathead River.\nThe mountain is named for Henry L. Stimson (1867–1950), former U.S. Secretary of State and twice Secretary of War, who hiked and assisted George Bird Grinnell survey the area in and around Glacier National Park in the 1890s, and supported efforts to establish the national park.\n\n\n== Notability ==\nMount Stimson is notable for its large, steep rise above local terrain. For example, its northwest face rises over 6,200 feet (1,900 m) from Nyack Creek in only 1.8 miles (2.9 km). This makes it \"truly a monster of a mountain.\" It is also notable for its isolation; it is one of the farthest peaks from a roadhead in the park.\n\n\n== Climate ==\n\n\n== History ==\nThe first recorded ascent of Mount Stimson was in 1951, by J. Gordon Edwards and Alice Edwards; however they found clear evidence of a previous ascent. The standard route of ascent is the West or Northwest Face Route, starting from Nyack Creek. A backpacking trail runs along Nyack Creek, providing access; however the National Park Service warns that this is a more brushy and isolated trail than in other areas of the park, with numerous unbridged stream crossings.  As in the rest of the park, grizzly bears are an issue as well. The climbing route begins with \"tiresome uphill bushwhacking...for possibly three hours\" leading to alternating slopes and cliffs (Grades 3 and 4). Other routes on the peak include the Southeast Spur from Martha's Basin and the Pinchot Creek Route from the south.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nMt. Stimson photo: Flickr",
      "summary": "Second highest peak in the park. Remote southwestern location, 5 miles from Lake McDonald."
    },
    {
      "name": "Tinkham Mountain",
      "lat": 48.52475,
      "lon": -113.50654,
      "elevation": 8442,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Tinkham_Mountain",
      "wikipedia_text": "Tinkham Mountain (8,447 feet (2,575 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. This mountain's name was officially adopted in 1929 by the United States Board on Geographic Names to recognize Lieutenant Abiel W. Tinkham, the first white man to cross the Continental Divide at what would later become Glacier National Park.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Lt. Abiel Tinkham, first non-native man to cross Continental Divide at what became Marias Pass."
    },
    {
      "name": "Razoredge Mountain",
      "lat": 48.55665,
      "lon": -113.5161,
      "elevation": 8610,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Razoredge_Mountain",
      "wikipedia_text": "Razoredge Mountain (8,570 feet (2,612 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Razoredge Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of Precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the Cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Razoredge Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Sharp-edged summit in the Lewis Range."
    },
    {
      "name": "Triple Divide Peak",
      "lat": 48.57291,
      "lon": -113.51698,
      "elevation": 8020,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Triple_Divide_Peak",
      "wikipedia_text": "Triple Divide Peak may refer to:\n\nTriple Divide Peak (Madera County, California)\nTriple Divide Peak (Montana) in Glacier National Park\nTriple Divide Peak (Tulare County, California)",
      "summary": "Where Hudson Bay, Gulf of Mexico, and Pacific Ocean drainages meet&mdash;one of two such points in North America."
    },
    {
      "name": "Norris Mountain",
      "lat": 48.5768,
      "lon": -113.53381,
      "elevation": 8882,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Norris_Mountain",
      "wikipedia_text": "Norris Mountain (8,887 feet (2,709 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Norris Mountain is situated along the Continental Divide; it is the parent of Triple Divide Peak—the point at which North America's Arctic, Atlantic, and Pacific drainage basins converge—located 0.8 miles (1.3 km) east-southeast.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Parent peak of Triple Divide Peak, which lies 0.8 miles south."
    },
    {
      "name": "Split Mountain",
      "lat": 48.59802,
      "lon": -113.53921,
      "elevation": 8792,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Split_Mountain_(Montana)",
      "wikipedia_text": "Split Mountain (8,797 feet (2,681 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Split Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range on the Continental Divide."
    },
    {
      "name": "Almost-a-Dog Mountain",
      "lat": 48.62271,
      "lon": -113.61922,
      "elevation": 8922,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Almost-a-Dog_Mountain",
      "wikipedia_text": "Almost-a-Dog Mountain (8,922 ft (2,719 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  The mountain is named for a Blackfoot warrior Almost A Dog or Imazí-imita who was a survivor of the 1870 Marias Massacre.  Although his entire family perished in the attack, he survived but was crippled for life.  He also survived the so-called Winter of Starvation in 1883–84.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\n\"Picture of Almost-a-Dog Mountain\". SummitPost.org. Retrieved May 7, 2011.\nAlmost-a-Dog Mountain photo: Flickr",
      "summary": "Named for Blackfoot warrior who survived 1870 Marias Massacre but was crippled."
    },
    {
      "name": "Red Mountain",
      "lat": 48.53549,
      "lon": -113.42407,
      "elevation": 9377,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Red_Mountain_(Glacier_County,_Montana)",
      "wikipedia_text": "Red Mountain (9,382 feet (2,860 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Red Mountain is 2.75 miles (4.43 km) north of Rising Wolf Mountain.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "About 2.75 miles north of Rising Wolf Mountain."
    },
    {
      "name": "Eagle Plume Mountain",
      "lat": 48.55295,
      "lon": -113.41766,
      "elevation": 8724,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Eagle_Plume_Mountain",
      "wikipedia_text": "Eagle Plume Mountain (8,724 ft (2,659 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Eagle Plume Mountain is connected by a gently sloping ridge to Mad Wolf Mountain to the north.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Connected by ridge to Mad Wolf Mountain."
    },
    {
      "name": "Bad Marriage Mountain",
      "lat": 48.56756,
      "lon": -113.41932,
      "elevation": 8350,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Bad_Marriage_Mountain",
      "wikipedia_text": "Bad Marriage Mountain (8,350 feet (2,545 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  The mountain was named by Superintendent E. T. Scoyen for a Blackfoot Indian leader Bad Married.  Bad Marriage Mountain became the accepted colloquial name.  At one time, the summit was called Elk Tongue by J.W. Schultz, an early chronicler of park geography and activities.  Because no Blackfoot equivalent to Elk Tongue was found, the English name was dropped and Bad Marriage Mountain became the official name.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nBad Marriage Mountain photo: Flickr",
      "summary": "Named for Blackfoot leader &#x27;Bad Married.&#x27; Formerly called Elk Point."
    },
    {
      "name": "Kupunkamint Mountain",
      "lat": 48.61833,
      "lon": -113.42172,
      "elevation": 8797,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Kupunkamint_Mountain",
      "wikipedia_text": "Kupunkamint Mountain (8,802 feet (2,683 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Kupunkamint Mountain is in the southeastern section of Glacier National Park. The mountain's name was officially adopted in 1940 by the United States Board on Geographic Names to commemorate a Kootenai Indian.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named in 1940 to honor a Kootenai chief who signed the 1855 Lame Bull Treaty."
    },
    {
      "name": "Medicine Owl Peak",
      "lat": 48.60884,
      "lon": -113.49548,
      "elevation": 8284,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Medicine_Owl_Peak",
      "wikipedia_text": "Medicine Owl Peak (8,284 feet (2,525 m)) is located in the Lewis Range, Glacier National Park, in the U.S. state of Montana. It is situated .71 mi (1.14 km) northwest of Amphitheater Mountain.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Northwest of Amphitheater Mountain."
    },
    {
      "name": "Ampitheatre Mountain",
      "lat": 48.59956,
      "lon": -113.48779,
      "elevation": 8690,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Amphitheater_Mountain_(Montana)",
      "wikipedia_text": "Amphitheater Mountain (8,695 feet (2,650 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Amphitheater Mountain is a descriptive name given to the peak because of its resemblance to the Greek Amphitheater. The mountain's Blackfoot name is Three Horns or Niuóxkai-ozkina for a Blackfoot warrior who captured a Nez Perce woman as was able to live happily ever after.  The mountain has also been named Whalen Mountain for a former park ranger.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Two Medicine region."
    },
    {
      "name": "Mount James",
      "lat": 48.58425,
      "lon": -113.49255,
      "elevation": 9375,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_James",
      "wikipedia_text": "Mount James (9,380 feet (2,859 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount James is 1.35 miles (2.17 km) northeast of Triple Divide Peak. The Blackfeet name for the mountain is Ah'-kow-to-mak-an (Double Runner).\n\n\n== Geology ==\nLike the mountains in Glacier National Park, Mt. James is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period. The route to climb to the top of the mountain is about 9 miles, and the mountain's latitude and longitude are 48.58442°N and -113.49233°W, or 48° 35' 4\" north and 113° 29' 32\" west. The average barometric pressure of the mountain is about 71KPa. There are also a variety of lakes and peaks surrounding the mountain as well, such as the Medicine Grizzly Lake, the Atlantic Falls, the Medicine Owl lake, the Norris Mountain Peak, the Medicine Grizzly Peak, and the Bad Marriage Mountain.\n\n\n== Climate ==\nBased on the Köppen climate classification, Mt. James is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F. In the summer, the sun can be out for around 16 hours before setting, and as short as 8 hours in the winter. Grizzly bears have commonly been spotted in this area during the warmer months as well, along with the American black bear as well as the Coyote.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nMount James Walker\nList of mountains of Jamaica\nList of mountains in Ethiopia\nList of mountains in Australia\n\n\n== References ==\n\n\n== External links ==\nFlickr photo: Mount James\nMount James weather: Mountain Forecast\nMount James, Mt James, Montana, USA Sunrise Sunset Times. (2025). Maplogs.com. [1]\nWorldwide Elevation Finder. (2025). Maplogs.com. [2]",
      "summary": "Blackfeet name: Ah&#x27;-kow-to-mak-an (Double Runner). Just 1.35 miles from Triple Divide Peak."
    },
    {
      "name": "Medicine Grizzly Mountain",
      "lat": 48.55915,
      "lon": -113.4657,
      "elevation": 8315,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Medicine_Grizzly_Peak",
      "wikipedia_text": "Medicine Grizzly Peak (8,320 feet (2,536 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nFlickr photo: Medicine Grizzly Peak",
      "summary": "Remote peak in the Lewis Range."
    },
    {
      "name": "McClintock Peak",
      "lat": 48.52497,
      "lon": -113.47274,
      "elevation": 8285,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/McClintock_Peak",
      "wikipedia_text": "McClintock Peak (8,290 feet (2,527 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. McClintock Peak is situated along the Continental Divide. The Lake of the Seven Winds sits below the east slopes of the peak and Mount Morgan is .56 mi (0.90 km) to the south.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, the mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nWalter McClintock lantern slides: Wikimedia\nWalter McClintock photo: Wikimedia",
      "summary": "Lake of the Seven Winds sits below east slopes. On Continental Divide."
    },
    {
      "name": "Mount Morgan",
      "lat": 48.51394,
      "lon": -113.47287,
      "elevation": 8791,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Morgan_(Montana)",
      "wikipedia_text": "Mount Morgan is an 8,781-foot elevation (2,676 m) mountain located in the Lewis Range, Glacier National Park in the U.S. state of Montana.  It is situated along the Continental Divide. Oldman Lake is immediately east of the peak.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Mount Morgan is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 miles (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, the mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F (-23 °C) with wind chill factors below −30 °F (-34 °C). Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "On Continental Divide with Oldman Lake immediately to the east."
    },
    {
      "name": "Mad Wolf Mountain",
      "lat": 48.56763,
      "lon": -113.36885,
      "elevation": 8341,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mad_Wolf_Mountain",
      "wikipedia_text": "Mad Wolf Mountain is located in the Lewis Range of the Glacier National Park in the U.S. state of Montana. Mad Wolf Mountain is just west of the Blackfeet Indian Reservation, and rises abruptly above the Great Plains. It stands at 8,341 feet, or 2,542 meters. A Blackfeet name for the mountain was Muk-sin-a', or \"Angry Woman\", named for a Blackfeet woman who captured an enemy man attempting to steal horses.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rises abruptly above Great Plains west of Blackfeet Reservation."
    },
    {
      "name": "Basin Mountain",
      "lat": 48.55112,
      "lon": -113.36331,
      "elevation": 6920,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Spot Mountain",
      "lat": 48.53378,
      "lon": -113.3558,
      "elevation": 7831,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Spot_Mountain",
      "wikipedia_text": "Spot Mountain is a 7,831-foot-elevation (2,387-meter) mountain summit located in the Two Medicine area of Glacier National Park, in Glacier County, Montana, United States. It is situated in the Lewis Range, nine miles northwest of East Glacier Park Village, and approximately five miles east of the Continental Divide. Precipitation runoff from the mountain drains into tributaries of Cut Bank Creek and Two Medicine River, which merge to form the Marias River. Topographic relief is significant as the south aspect rises nearly 3,000 feet (910 meters) above Lower Two Medicine Lake in two miles. The mountain's name was officially adopted in 1929 by the United States Board on Geographic Names.\n\n\n== Geology ==\nThe mountains in Glacier National Park are composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Spot Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== Gallery ==\n\n\n== See also ==\n\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Spot Mountain",
      "summary": "In Two Medicine area, about 9 miles from East Glacier Park Village."
    },
    {
      "name": "Loneman Mountain",
      "lat": 48.48909,
      "lon": -113.76938,
      "elevation": 7181,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": "Home to a fire lookout tower."
    },
    {
      "name": "Threesuns Mountain",
      "lat": 48.49027,
      "lon": -113.65581,
      "elevation": 8205,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Threetops Mountain",
      "lat": 48.45753,
      "lon": -113.70453,
      "elevation": 6790,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Mount Saint Nicholas",
      "lat": 48.39147,
      "lon": -113.55047,
      "elevation": 9376,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Saint_Nicholas",
      "wikipedia_text": "Mount Saint Nicholas is a peak in the remote southwestern section of Glacier National Park, in Montana. It is a particularly steep, pointed rock pinnacle, and its distinctive profile is visible from many summits in the southern half of the park. Because even its easiest ascent route is technical, with poor rock quality, it is \"considered the most dangerous and difficult mountain for climbers in Glacier National Park.\"\nMount Saint Nicholas excels in terms of steep vertical relief, even by the high standards prevalent in Glacier National Park. For example, its northwest face rises one vertical mile (5,300 ft; 1,600 m) in approximately 1.5 horizontal miles (7,900 ft; 2.4 km). Due to its pointed shape and isolation from the Continental Divide, it has similarly precipitous drops in all directions.\nIn 1926, Reverend Conrad Wellen of Havre, Montana made the first ascent of Mount Saint Nicholas. The mountain had previously been considered by many to be unclimbable. The standard route is the Northeast Ridge. Starting from the east side of the peak, this route begins with a straightforward scramble up a gully to a prominent notch. From the notch a thousand vertical feet of somewhat technical climbing remain.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park\n\n\n== References ==\n\n\n== External links ==\nMount Saint Nicholas on TopoQuest",
      "summary": "Steep pointed pinnacle visible from many southern park summits. Technical climb required."
    },
    {
      "name": "Church Butte",
      "lat": 48.38154,
      "lon": -113.51397,
      "elevation": 8808,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Church_Butte",
      "wikipedia_text": "Church Butte is a 8,816 feet (2,687 m) butte located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Distinctive butte shape in the Lewis Range."
    },
    {
      "name": "Salvage Mountain",
      "lat": 48.37563,
      "lon": -113.53448,
      "elevation": 8328,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Salvage_Mountain",
      "wikipedia_text": "Salvage Mountain (8,328 feet (2,538 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== Cited references ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Battlement Mountain",
      "lat": 48.41428,
      "lon": -113.51615,
      "elevation": 8830,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Battlement_Mountain",
      "wikipedia_text": "Battlement Mountain (8,830 feet (2,691 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Lake Isabel is northeast of the peak.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Lake Isabel lies to the northeast."
    },
    {
      "name": "Mount Doody",
      "lat": 48.42996,
      "lon": -113.57573,
      "elevation": 8640,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Doody",
      "wikipedia_text": "Mount Doody (8,644–8,684 feet (2,635–2,647 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Doody is astride the same ridgeline as the Cloudcroft Peaks which are to the immediate northeast. Dan Doody was one of the first six rangers at Glacier National Park. Doody patrolled the Middle Fork drainages, using his own homestead as a headquarters. Later, because of his recognized hunting abilities, Doody became a park hunter skilled at removing \"undesirable\" wildlife from the area.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nDan Doody photo: NPS.gov\nWeather forecast: Mount Doody",
      "summary": "Named for Dan Doody, one of the park&#x27;s first six rangers who patrolled Middle Fork country."
    },
    {
      "name": "Cloudcroft Peaks",
      "lat": 48.43685,
      "lon": -113.56519,
      "elevation": 8600,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Cloudcroft_Peaks",
      "wikipedia_text": "Cloudcroft Peaks (8,714 feet (2,656 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== Climate ==\nCloudcroft Peaks is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike the other mountains in Glacier National Park, Cloudcroft Peaks is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Multi-summit formation in the Lewis Range."
    },
    {
      "name": "Mont Phillips",
      "lat": 48.47746,
      "lon": -113.52517,
      "elevation": 9494,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Phillips_(Montana)",
      "wikipedia_text": "Mount Phillips (9,498 feet (2,895 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Lupfer Glacier is located on the east slope of Mount Phillips.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Lupfer Glacier lies on its slopes."
    },
    {
      "name": "Wolftail Mountain",
      "lat": 48.44072,
      "lon": -113.6105,
      "elevation": 8195,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Wolftail_Mountain",
      "wikipedia_text": "Wolftail Mountain (8,176 feet (2,492 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Wolftail Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Peril Peak",
      "lat": 48.45632,
      "lon": -113.59033,
      "elevation": 8645,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Peril_Peak",
      "wikipedia_text": "Peril Peak (8,645 feet (2,635 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Eaglehead Mountain",
      "lat": 48.47334,
      "lon": -113.60533,
      "elevation": 9140,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Eaglehead_Mountain",
      "wikipedia_text": "Eaglehead Mountain (9,145 feet (2,787 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Buffalo Woman Lake is east of the peak.\n\n\n== Gallery ==\n\nEaglehead Mountain (right) across Buffalo Woman Lake\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Buffalo Woman Lake sits to the east."
    },
    {
      "name": "Mount Pinchot",
      "lat": 48.49544,
      "lon": -113.59515,
      "elevation": 9310,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Pinchot_(Montana)",
      "wikipedia_text": "Mount Pinchot (9,315 feet (2,839 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Pinchot is less than 1.5 miles (2.4 km) SSE of Mount Stimson while Beaver Woman Lake is southeast of Mount Pinchot.\nMount Pinchot is named for Gifford Pinchot, pioneering forester and past Chief of United States Forest Service, which he helped organize.  The name, Mount Pinchot, was officially approved by the United States Geographic Board on March 6, 1929.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nBeaver Woman Lake\nBuffalo Woman Lake\n\n\n== References ==",
      "summary": "Named for Gifford Pinchot, pioneering forester and first Chief of the U.S. Forest Service."
    },
    {
      "name": "Statuary Mountain",
      "lat": 48.39168,
      "lon": -113.49219,
      "elevation": 8250,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Vigil Peak",
      "lat": 48.41576,
      "lon": -113.48418,
      "elevation": 8593,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Vigil_Peak",
      "wikipedia_text": "Vigil Peak (8,593 feet (2,619 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Lake Isabel is northwest of the peak.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Lake Isabel lies to the northwest."
    },
    {
      "name": "Mount Despair",
      "lat": 48.39861,
      "lon": -113.43198,
      "elevation": 8582,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Despair_(Montana)",
      "wikipedia_text": "Mount Despair (8,587 feet (2,617 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Eagle Ribs Mountain",
      "lat": 48.40592,
      "lon": -113.41736,
      "elevation": 8290,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Eagle_Ribs_Mountain",
      "wikipedia_text": "Eagle Ribs Mountain (8,295 feet (2,528 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Eagle Ribs Mountain has an adjacent peak that is unnamed and is slightly taller at 8,406 ft (2,562 m) to the southeast while to the southwest lies Mount Despair.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Has an unnamed adjacent peak slightly taller to the southeast."
    },
    {
      "name": "Caper Peak",
      "lat": 48.43393,
      "lon": -113.49835,
      "elevation": 8310,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Caper_Peak",
      "wikipedia_text": "Caper Peak (8,268 feet (2,520 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Caper Peak is approximately 1.4 miles (2.3 km) NNW of Vigil Peak. Richard T. Evans, USGS topographer who worked on the early map of Glacier Park, named this mountain when he counted over 30 goats \"capering\" on this peak. (Caper: A leap; a skip or spring, as in dancing or mirth, or in the frolic of a kid or lamb.)\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nCaper: Wiktionary.org\nWeather: Caper Peak",
      "summary": "Located about 1.4 miles from neighboring peaks."
    },
    {
      "name": "Grizzly Mountain",
      "lat": 48.41858,
      "lon": -113.40201,
      "elevation": 9067,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Grizzly_Mountain_(Montana)",
      "wikipedia_text": "Grizzly Mountain (9,072 feet (2,765 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Grizzly Mountain sits astride the Continental Divide in the Two Medicine region of Glacier National Park.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Straddles the Continental Divide in the Two Medicine region."
    },
    {
      "name": "Chief Lodgepole Peak",
      "lat": 48.43074,
      "lon": -113.42501,
      "elevation": 7682,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Painted_Tepee_Peak",
      "wikipedia_text": "Painted Tepee Peak, or simply Painted Tepee (also Tipi or Teepee) is a mountain located in Glacier National Park in the U.S. state of Montana near the Two Medicine Pass.  The altitude of the highest point is 7,650 feet (2,332 m). The summit lies to the south of Two Medicine Lake, and is within view of Grizzly Mountain, Chief Lodgepole Peak, and Mount Rockwell. The mountain lies along the Two Mountain Pass Trail.\n\n\n== See also ==\nList of mountains in Glacier County, Montana\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nList of trails of Glacier County, Montana\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n Glacier National Park travel guide from Wikivoyage",
      "summary": "Near Painted Tepee Peak in Two Medicine area."
    },
    {
      "name": "Mount Rockwell",
      "lat": 48.44333,
      "lon": -113.45112,
      "elevation": 9272,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Rockwell",
      "wikipedia_text": "Mount Rockwell (9,277 feet (2,828 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Rockwell is situated along the Continental Divide and Aurice Lake is just west of the peak. A Blackfeet name for the mountain is \"Rising Bull Mountain.\" It was named for a Blackfeet chief who, after staying with the Flathead people of his wife for a number of winters, was appointed one of their chiefs for his bravery and his kind and generous nature.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Blackfoot name: &#x27;Rising Bull Mountain.&#x27; Named for chief who lost his vision on a war party."
    },
    {
      "name": "Lone Walker Mountain",
      "lat": 48.45318,
      "lon": -113.47881,
      "elevation": 8502,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Lone_Walker_Mountain",
      "wikipedia_text": "Lone Walker Mountain (8,502 feet (2,591 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Lone Walker Mountain is situated immediately southwest of Upper Two Medicine Lake along the Continental Divide.\n\n\n== Climate ==\nBased on the Köppen climate classification, it is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, it is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Southwest of Upper Two Medicine Lake on Continental Divide."
    },
    {
      "name": "Mount Helen",
      "lat": 48.47461,
      "lon": -113.46665,
      "elevation": 8538,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Helen_(Montana)",
      "wikipedia_text": "Mount Helen (8,538 feet (2,602 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Helen rises immediately to the northwest roughly 3,100 feet (940 m) above Upper Two Medicine Lake in the southeastern part of Glacier National Park. The Continental Divide of the Americas passes over the summit of Mount Helen.\n\n\n== Geology ==\nLike the mountains in Glacier National Park, Mt. Helen is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, Mt. Helen is located in an alpine subarctic climate zone characterized by long, usually very cold winters, and short, cool to mild summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Rises 3,100 feet above Upper Two Medicine Lake. The Continental Divide passes over Mount Helen's summit."
    },
    {
      "name": "Flinsch Peak",
      "lat": 48.49837,
      "lon": -113.46622,
      "elevation": 9225,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Flinsch_Peak",
      "wikipedia_text": "Flinsch Peak (9,225 ft (2,812 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. It is 2.3 miles (3.7 km) west of Rising Wolf Mountain and straddles the Continental Divide. Viewed from Oldman Lake, the summit has a distinctive horn shape. Young Man Lake is immediately east of the peak.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Distinctive horn shape viewed from Oldman Lake. Young Man Lake to the east."
    },
    {
      "name": "Pumpelly Pillar",
      "lat": 48.47484,
      "lon": -113.45014,
      "elevation": 7620,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Pumpelly_Pillar",
      "wikipedia_text": "Pumpelly Pillar (7,625 feet (2,324 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Located in the Two Medicine region in the southeastern section of Glacier National Park, the peak is likely named after Raphael Pumpelly, who lead the Northern Transcontinental Railway Survey party that crossed Pitamakan Pass in 1883.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nPumpelly Pillar photo: Flickr",
      "summary": "Likely named for Raphael Pumpelly who led 1882 Northern Transcontinental Railway Survey."
    },
    {
      "name": "Rising Wolf Mountain",
      "lat": 48.4961,
      "lon": -113.41598,
      "elevation": 9513,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Rising_Wolf_Mountain",
      "wikipedia_text": "Rising Wolf Mountain - Mah-kwi-i-po-ats-ists (Wolf Rising Mountain), (9,513 feet (2,900 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The peak is in the southeastern section of the park and rises dramatically above the Two Medicine region and more than 4,450 ft (1,360 m) above Two Medicine Lake immediately to the south. The Blackfeet consider the Two Medicine region of the park to be sacred ground and their name for the peak, \"Mah-kwi-i-po-ats-sin\", meaning, The way the wolf gets up, was later translated to the current name of the mountain.\nRising Wolf Mountain was named after Hugh Monroe, a fur trader who lived with the Pikunis and gave him the name Rising Wolf.  After his death, his close friend and author James Willard Schultz named the peak after Monroe.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Gallery ==\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Blackfoot: Mah-kwi-i-po-ats-ists. Rises 4,450 feet above Two Medicine Lake."
    },
    {
      "name": "Sinopah Mountain",
      "lat": 48.4631,
      "lon": -113.41237,
      "elevation": 8271,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Sinopah_Mountain",
      "wikipedia_text": "Sinopah Mountain (8,276 feet (2,523 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Sinopah Mountain rises prominently to the west of Two Medicine Lake. Sinopah means, \"\"kit fox\" in Blackfeet, (who) was the Indian wife of Hugh Monroe (Rising Wolf) and daughter of Lone Walker, a powerful Blackfeet chief.\"\n\n\n== Geology ==\nLike other mountains in Glacier National Park, the peak is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nBased on the Köppen climate classification, the peak is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Temperatures can drop below −10 °F with wind chill factors below −30 °F.\n\n\n== Gallery ==\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Sinopah Mountain",
      "summary": "&#x27;Sinopah&#x27; means &#x27;kit fox&#x27; in Blackfoot&mdash;name of Hugh Monroe&#x27;s wife, daughter of Lone Walker."
    },
    {
      "name": "Rising Bull Ridge",
      "lat": 48.4491,
      "lon": -113.45522,
      "elevation": 8400,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Painted Tepee Peak",
      "lat": 48.44218,
      "lon": -113.41206,
      "elevation": 7650,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Painted_Tepee_Peak",
      "wikipedia_text": "Painted Tepee Peak, or simply Painted Tepee (also Tipi or Teepee) is a mountain located in Glacier National Park in the U.S. state of Montana near the Two Medicine Pass.  The altitude of the highest point is 7,650 feet (2,332 m). The summit lies to the south of Two Medicine Lake, and is within view of Grizzly Mountain, Chief Lodgepole Peak, and Mount Rockwell. The mountain lies along the Two Mountain Pass Trail.\n\n\n== See also ==\nList of mountains in Glacier County, Montana\nList of mountains and mountain ranges of Glacier National Park (U.S.)\nList of trails of Glacier County, Montana\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\n Glacier National Park travel guide from Wikivoyage",
      "summary": "Near Two Medicine Pass. Visible from Two Medicine Lake."
    },
    {
      "name": "Never Laughs Mountain",
      "lat": 48.44554,
      "lon": -113.38163,
      "elevation": 7341,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Never_Laughs_Mountain",
      "wikipedia_text": "Never Laughs Mountain (7,641 feet (2,329 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The mountain is likely named for the Blackfeet “Kat-aiyimi”, wording for never laughs, also the band of the Piegan Blackfeet. Never Laughs Mountain is easily seen to the south of Two Medicine Lake and is .59 mi (0.95 km) NW of Mount Ellsworth.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for Blackfoot &#x27;Kat-aiyimi&#x27; meaning &#x27;never laughs,&#x27; a Piegan band name."
    },
    {
      "name": "Calf Robe Mountain",
      "lat": 48.38736,
      "lon": -113.3331,
      "elevation": 7948,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Calf_Robe_Mountain",
      "wikipedia_text": "Calf Robe Mountain is a 7,948-foot-elevation (2,423-meter) mountain summit located in Glacier National Park in the U.S. state of Montana. It is situated on the Continental Divide in the Lewis Range, and can be seen from Highway 2 midway between Marias Pass and East Glacier Park. The summit is set on the border shared by Flathead County and Glacier County. Topographic relief is significant as the east aspect rises 2,500 feet (760 meters) in one mile. The immediate area between the mountain and highway is known for its aspen and beaver dams.\n\n\n== Etymology ==\nThe mountain's name, which commemorates Calf Robe, member of the Blackfeet, was submitted by the National Park Service in 1939, and officially adopted in 1940 by the United States Board on Geographic Names. Legend has it that Calf Robe supposedly had a weird experience with a grizzly bear about 1870. Calf Robe was deserted by his fellow warriors in enemy country and left to die; but he was soon rescued by a grizzly bear, which brought him food and carried him to help. The grizzly only asked a favor in return: that Calf Robe would never kill a bear in winter, which is why the Piikani will never kill a hibernating bear. The Blackfeet name for Calf Robe is \"Onistai'yi\".\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Calf Robe Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Calf Robe Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer. Precipitation runoff from the east side of the mountain drains into tributaries of the Two Medicine River, and the west side drains to Ole Creek, which is a tributary of Middle Fork Flathead River.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Calf Robe Mountain",
      "summary": "On Continental Divide. Visible from Highway 2 between Marias Pass and East Glacier."
    },
    {
      "name": "Red Crow Mountain",
      "lat": 48.4014,
      "lon": -113.34833,
      "elevation": 7891,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Red_Crow_Mountain",
      "wikipedia_text": "Red Crow Mountain is a 7,891-foot-elevation (2,405-meter) mountain summit located in Glacier National Park in the U.S. state of Montana. The summit is set on the border shared by Flathead County and Glacier County. It is situated on the Continental Divide so precipitation runoff from the east side of the mountain drains into Railroad Creek which is part of the Two Medicine River watershed, and the west side drains to Ole Creek, which is a tributary of Middle Fork Flathead River. It is set in the Lewis Range, 6.5 miles southwest of East Glacier Park Village. Topographic relief is significant as the east aspect rises approximately 2,000 feet (610 meters) in one mile. The nearest higher neighbor is Calf Robe Mountain 1.2 mile to the southeast, with Firebrand Pass forming the saddle between these two peaks.\n\n\n== Etymology ==\nThe mountain's name commemorates Red Crow (1830–1900), leader of the Kainai. The toponym was officially adopted in 1911 by the United States Board on Geographic Names.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Red Crow Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Red Crow Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== See also ==\n\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Red Crow Mountain\nHiking video: YouTube\nRed Crow Mountain photo album: Flickr",
      "summary": "On Continental Divide between Flathead and Glacier Counties."
    },
    {
      "name": "Bearhead Mountain",
      "lat": 48.42404,
      "lon": -113.35615,
      "elevation": 8406,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Bearhead_Mountain_(Montana)",
      "wikipedia_text": "Bearhead Mountain (8,406 feet (2,562 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. The mountain is named for kyáiyótokan, a Piegan warrior known for his war against the dreaded Assiniboine White Dog.  kyáiyótokan was also a survivor of the Marias Massacre and the brother of Chief Heavy Runner a confidant of Glacier author James Willard Schultz.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named for ky&aacute;iy&oacute;tokan, a Piegan warrior, Marias Massacre survivor, and brother of Chief Heavy Runner."
    },
    {
      "name": "Dancing Lady Mountain",
      "lat": 48.43045,
      "lon": -113.30125,
      "elevation": 7353,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Dancing_Lady_Mountain",
      "wikipedia_text": "Dancing Lady Mountain is a summit in Glacier County, Montana, in the United States and it is located within Glacier National Park. Dancing Lady is derived from a Blackfoot-language name. The mountain's former name of Squaw Mountain was changed due to ongoing controversy over the term \"squaw\".\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Derived from Blackfoot name. Formerly &#x27;Squaw Mountain&#x27; until renamed."
    },
    {
      "name": "Mount Ellsworth",
      "lat": 48.43634,
      "lon": -113.36904,
      "elevation": 8581,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Ellsworth",
      "wikipedia_text": "Mount Ellsworth can refer to:\n\nMount Ellsworth (Antarctica), the highest peak in the Queen Maud Mountains in Antarctica\nMount Ellsworth (Montana), in Glacier National Park, Montana, United States\nMount Ellsworth (Utah), in the Henry Mountains, Utah, United States",
      "summary": "Named summit in the Lewis Range."
    },
    {
      "name": "Mount Henry",
      "lat": 48.45311,
      "lon": -113.34352,
      "elevation": 8847,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Mount_Henry_(Montana)",
      "wikipedia_text": "Mount Henry (8,852 feet (2,698 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Mount Henry is just south of Appistoki Peak in the Two Medicine region of the park.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Just south of Appistoki Peak in the Two Medicine region."
    },
    {
      "name": "Bison Mountain",
      "lat": 48.46527,
      "lon": -113.31032,
      "elevation": 7833,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Appistoki Peak",
      "lat": 48.46769,
      "lon": -113.35447,
      "elevation": 8164,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Appistoki_Peak",
      "wikipedia_text": "Appistoki Peak (8,169 feet (2,490 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Appistoki Peak, \"was named by R. T. Evans, a topographer who worked on the early map of the park. It is reported that he inquired from his Indian guide what word the Blackfeet used for \"looking over something,\" and the guide, misunderstanding the meaning of his question, gave him the name \"Appistoki,\" for the Indian god who looks over everything and everyone.\" Appistoki Peak rises on the southeast shore of Two Medicine Lake and is a short distance north of Mount Henry.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named using Blackfoot word for &#x27;looking over something&#x27; by topographer R.T. Evans."
    },
    {
      "name": "Scenic Point",
      "lat": 48.48494,
      "lon": -113.32218,
      "elevation": 7522,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Scenic_Point",
      "wikipedia_text": "Scenic Point is a 7,522-foot-elevation (2,293-meter) mountain summit located in the Two Medicine area of Glacier National Park, in Glacier County, Montana, United States. It is situated in the Lewis Range, six miles northwest of East Glacier Park Village, and approximately seven miles east of the Continental Divide, with precipitation runoff from the mountain draining into the Two Medicine River watershed. Topographic relief is significant as the north aspect rises over 2,600 feet (790 meters) above Lower Two Medicine Lake in one mile. Access to the summit is via the Continental Divide National Scenic Trail which traverses the upper slopes of this mountain. The trail to Scenic Point was constructed by the Great Northern Railway, and the summit once hosted a locomotive bell, a Swiss Alps tradition. The mountain's name was officially adopted in 1929 by the United States Board on Geographic Names.\n\n\n== Geology ==\nThe mountains in Glacier National Park are composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Scenic Point is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer.\n\n\n== Gallery ==\n\n\n== See also ==\n\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather forecast: Scenic Point\nScenic Point trail: Hikinginglacier.com",
      "summary": "Popular hiking destination in Two Medicine area, about 6 miles from East Glacier."
    },
    {
      "name": "Running Rabbit Mountain",
      "lat": 48.26055,
      "lon": -113.54021,
      "elevation": 7674,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Snowslip Mountain",
      "lat": 48.26257,
      "lon": -113.51529,
      "elevation": 7290,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Mount Shields",
      "lat": 48.27545,
      "lon": -113.51606,
      "elevation": 7131,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Scalplock Mountain",
      "lat": 48.30008,
      "lon": -113.57464,
      "elevation": 6919,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Scalplock_Mountain_Fire_Lookout",
      "wikipedia_text": "The Scalplock Mountain Fire Lookout in Glacier National Park is significant as one of a chain of staffed fire lookout posts within the park. The low two-story timber-construction structure with a pyramidal roof was built in 1931. The lookout affords views into the Park Creek valley and the Middle Fork of the Flathead River, which was traversed by the Great Northern Railway (U.S.) and US 2, prolific sources of fires. The lookout was built to standard plans derived from U.S. Forest Service plans.\n\n\n== References ==\n\n\n== External links ==\nPhotographs of the Scalplock Mountain Fire Lookout at the National Park Service's NRHP database",
      "summary": "Historic 1931 fire lookout still stands, overlooking Park Creek valley."
    },
    {
      "name": "Rampage Mountain",
      "lat": 48.34583,
      "lon": -113.58841,
      "elevation": 6855,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Rampage_Mountain",
      "wikipedia_text": "Rampage Mountain is a summit in Flathead County, Montana, in the United States. With an elevation of 6,855 feet (2,089 m), Rampage Mountain is the 1675th highest summit in the state of Montana. It is situated within Glacier National Park.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Rampage Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer. Precipitation runoff from the mountain drains into tributaries of Middle Fork Flathead River. This climate supports a Lodgepole pine forest on its lower slopes.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nWeather: Rampage Mountain",
      "summary": "6,855-foot summit in Flathead County."
    },
    {
      "name": "Riverview Mountain",
      "lat": 48.36672,
      "lon": -113.61647,
      "elevation": 6390,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Soldier Mountain",
      "lat": 48.34077,
      "lon": -113.50102,
      "elevation": 7320,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Elk Mountain",
      "lat": 48.30656,
      "lon": -113.44441,
      "elevation": 7835,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Elk_Mountain_(Flathead_County,_Montana)",
      "wikipedia_text": "Elk Mountain is a 7,835-foot-elevation (2,388-meter) mountain summit located in Flathead County in the U.S. state of Montana. It is situated in the southern tip of Glacier National Park, in the Lewis Range, about four miles to the west side of the Continental Divide. US Highway 2 and the Hi-Line Subdivision of the BNSF Railway traverse the southern base of this mountain, approximately four miles west of Marias Pass. Topographic relief is significant as the northwest aspect rises 3,400 feet (1,000 meters) above Ole Creek in one mile. The nearest higher neighbor is Sheep Mountain 2.7 miles to the north-northwest. The mountain's name first appeared on a 1914 USGS map, and was officially adopted in 1929 by the United States Board on Geographic Names. The summit is the site of a former fire lookout that was built in the 1930s, and removed in 1963.\n\n\n== Geology ==\nLike other mountains in Glacier National Park, Elk Mountain is composed of sedimentary rock laid down during the Precambrian to Jurassic periods. Formed in shallow seas, this sedimentary rock was initially uplifted beginning 170 million years ago when the Lewis Overthrust fault pushed an enormous slab of precambrian rocks 3 mi (4.8 km) thick, 50 miles (80 km) wide and 160 miles (260 km) long over younger rock of the cretaceous period.\n\n\n== Climate ==\nAccording to the Köppen climate classification system, Elk Mountain is located in an alpine subarctic climate zone with long, cold, snowy winters, and cool to warm summers. Winter temperatures can drop below −10 °F with wind chill factors below −30 °F. Due to its altitude, it receives precipitation all year, as snow in winter, and as thunderstorms in summer. Precipitation runoff from the mountain drains into Autumn and Ole Creeks, which are both tributaries of Middle Fork Flathead River. This climate supports a Lodgepole pine forest on its lower slopes.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\nGeology of the Rocky Mountains\n\n\n== References ==\n\n\n== External links ==\nElk Mountain trail: Enjoyyourparks.com\nElk Mountain trail: Hikingproject.com",
      "summary": "Southern tip of park near Highway 2 and BNSF rail line at Marias Pass."
    },
    {
      "name": "Little Dog Mountain",
      "lat": 48.34313,
      "lon": -113.38687,
      "elevation": 8610,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Little_Dog_Mountain",
      "wikipedia_text": "Little Dog Mountain (8,610 feet (2,624 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Little Dog Mountain sits along the Continental Divide and can be easily seen from Marias Pass. The mountain was named by George Bird Grinnell for \"Little Dog,\" Blackfoot Indian Chief who, in 1853, informed Isaac Stevens, the new Governor of the Washington Territory, of the existence of Marias Pass.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Named by Grinnell for Blackfoot Chief &#x27;Little Dog&#x27; who guided Isaac Stevens in 1853."
    },
    {
      "name": "Sheep Mountain",
      "lat": 48.34144,
      "lon": -113.47106,
      "elevation": 8569,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Sheep_Mountain_(Flathead_County,_Montana)",
      "wikipedia_text": "Sheep Mountain (8,537 feet (2,602 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nList of mountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Brave Dog Mountain",
      "lat": 48.35894,
      "lon": -113.46118,
      "elevation": 8510,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Brave_Dog_Mountain",
      "wikipedia_text": "Brave Dog Mountain (8,468 feet (2,581 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Located in the Lewis Range."
    },
    {
      "name": "Summit Mountain",
      "lat": 48.35383,
      "lon": -113.37039,
      "elevation": 8770,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Summit_Mountain_(Glacier_National_Park)",
      "wikipedia_text": "Summit Mountain (8,775 feet (2,675 m)) is located in the Lewis Range, Glacier National Park in the U.S. state of Montana. Summit Mountain towers to the north of Marias Pass and is situated along the Continental Divide.\n\n\n== See also ==\nMountains and mountain ranges of Glacier National Park (U.S.)\n\n\n== References ==",
      "summary": "Towers north of Marias Pass along the Continental Divide."
    },
    {
      "name": "Skeleton Mountain",
      "lat": 48.37184,
      "lon": -113.36209,
      "elevation": 7450,
      "has_article": false,
      "wikipedia_url": null,
      "wikipedia_text": null,
      "summary": null
    },
    {
      "name": "Huckleberry Mountain",
      "lat": 48.60039,
      "lon": -114.13434,
      "elevation": 6593,
      "has_article": true,
      "wikipedia_url": "https://en.wikipedia.org/wiki/Glacier_View_Dam",
      "wikipedia_text": "Glacier View Dam was proposed in 1943 on the North Fork of the Flathead River, on the western border of Glacier National Park in Montana. The 416-foot (127 m) tall dam,  to be designed and constructed by the U.S. Army Corps of Engineers in the canyon between Huckleberry Mountain and Glacier View Mountain, would have flooded in excess of 10,000 acres (4,000 ha) of the park. In the face of determined opposition from the National Park Service and conservation groups, the dam was never built.\n\n\n== Proposal ==\nThe Glacier View project was proposed after an earlier proposal by the Corps of Engineers and the Bonneville Power Administration to raise the level of Flathead Lake by increasing the height of Kerr Dam at its outlet was rejected, following local protests.  Located in a relatively unpopulated area, the Glacier View reservoir would have flooded lower Camas Creek and would have raised the level of Logging Lake by 50 feet (15 m), inundating much of the winter range for the park's white-tailed deer, elk, mule deer and moose. The proposed reservoir was to extend nearly to the Canada–US border, at an estimated cost of $94,962,000. The dam was supported by Montana Representative Mike Mansfield and Flathead Valley interests but was opposed by former Senator Burton K. Wheeler, local ranchers, the National Park Service, the Glacier Park Hotel Company, the Sierra Club, Society of American Foresters and the Audubon Society. Public hearings were held in 1948 and 1949. Turnout at the 1948 hearings at Kalispell was influenced by extensive flooding then occurring in the Flathead Valley. Exploratory drilling took place in 1944 and 1945 at Glacier View and Foolhen Hill. The project was terminated by a joint memorandum between the Secretary of the Interior and the Secretary of the Army on April 11, 1949, but Mansfield introduced an unsuccessful bill later in the year directing the Corps of Engineers to proceed with the dam, stating that the dam \"would not affect the beauty of the park in any way but would make it more beautiful by creating a large lake over ground that ... has no scenic attraction.\" The Corps of Engineers report on the project noted:  The park lands that will be inundated and required for freeboard of 5 feet above normal pool elevation amounts to 10,175 acres (4,118 ha), or about 1 percent of the total Glacier National Park area. This area does not lie within the rugged, glacier-covered portion of the park for which it is noted, but rather is on the western boundary line, in a little-used valley. The reservoir area is covered with lodge-pole pine, an inferior species of limited use. Other species of pine timber such as ponderosa pine, are predominate above the normal full reservoir and will not be injured by the project. Other lands inundated or required by this project are in private, State and United States Forest Service ownership and hence should be of no concern to the Park Service. Although there would be some effect on the wildlife in the area, the construction of Glacier View Reservoir would inconvenience but relatively few people as it is situated in a sparsely populated area.\nPark Service Director Newton B. Drury responded:\n\nThe effects of the proposed impoundment of the North Fork of the Flathead River upon Glacier National Park would be extraordinarily serious upon the very values with the National Park Service is obliged by law, and expected by the public, to protect ... The flooding of park land would reduce the winter range of [white-tailed deer] by 56 percent. In order to prevent extensive starvation, it would be necessary for the Park Service to undertake the slaughter of most of these animals ... We cannot afford, except for the most compelling reasons — which we are convinced do not exist in this case — to permit this impairment of one of the finest properties of the American people.\nDrury went on to state that 19,460 acres (7,880 ha) of land would be flooded, including virgin Ponderosa pine. In order to show that the area was of recreational value, the Park Service constructed the Camas Creek Road through the area.\nThe dam was opposed by the Park Service and conservation organizations on principal as an intrusion into lands that had been made inviolate by their inclusion in a national park, with about a third of the reservoir located on Park Service lands. The precedent established at Hetch Hetchy in Yosemite National Park was not to be repeated. A similar, more difficult fight followed over the proposed Echo Park Dam in Dinosaur National Monument.\n\n\n== Related projects ==\nA related project, the Paradise project on the Clark Fork River just below its confluence with the Flathead, was opposed by local interests. The Paradise project was considered by the Corps of Engineers to be a more desirable project than Glacier Point, but was considered by the Corps to be difficult to develop compared to Glacier View, given the developed nature of the flooded area proposed at Paradise versus the relatively unpopulated Glacier View region.  Other proposed dams were the Smoky Range, Canyon Creek and Spruce Park dams, none of which were built. Hungry Horse Dam was, however,  completed in 1953 by the U.S. Bureau of Reclamation on the South Fork of the Flathead. The Spruce Park reservoir to the south of the park was proposed to have been connected to the Hungry Horse reservoir, with a power generation plant at the conduit's discharge. Paradise Dam is described by the Corps of Engineers as preferable from the point of view of the overall plan, standing on both the Clark Fork River and the Flathead, but the flooding of towns and productive agricultural lands stirred intense local opposition.\nThe 1950 Corps of Engineers report that detailed the Glacier View project also mentioned the potential of the Middle Fork Flathead River for development, and projected a dam at Belton, with a 1,190,000-acre-foot (1.47 km3) reservoir behind a dam developing 330 feet (100 m) of hydraulic head, for a potential generating capacity of 152 MW. As the Middle Fork forms the southwest boundary of Glacier National Park, any reservoir on the Middle Fork near Belton would necessarily flood portions of the park. With the rejection of the Glacier View project, the Belton project never progressed beyond its listing as a potential project.\n\n\n== Description ==\n\nThe proposed Glacier View Dam was to be a 416-foot (127 m) high, 2,100-foot (640 m) long earth embankment dam, impounding a reservoir with a capacity of 3,160,000 acre-feet (3.90 km3) and covering an area of about 48 square miles (120 km2). A gated spillway was to be built to the north side, feeding a tunnel through the abutment. A powerplant at the toe of the dam was planned to house three 70 MW generating units, fed by an intake tower and equipped with a surge tank. The chosen site was to be at river mile 176.5. Alternate sites at Fool Hen Hill (river mile 167) and Bad Rock Canyon (river mile 150) were rejected. The Fool Hen Hill site was found to have a permeable alluvial channel in the right abutment. The Bad Rock Canyon site would have been on the main stem of the Flathead and was also determined to have poor abutment rock, as well as alluvial deposits on the valley floor reaching up to 300 ft (91 m) deep. It would have flooded the Hungry Horse damsite, which was under construction, as well as Lake McDonald in the park.\n\n\n== Present ==\nThe Camas Road joins the Outside North Fork Road just to the east of the damsite. The Forests and Fire Nature Trail is just upstream from the site. The Logging Creek Ranger Station and the small town of Polebridge lie within the proposed reservoir. Within the park, the lower reaches of Camas Creek, Quartz Creek, Bowman Creek and Akokala Creek would have been flooded, along with most of Logging Creek and Logging Lake.\n\n\n== References ==",
      "summary": "Located near the park&#x27;s western boundary on the North Fork Flathead River."
    }
  ],
  "metadata": {
    "total_peaks": 185,
    "peaks_with_articles": 161,
    "peaks_without_articles": 24,
    "generated_at": "2026-01-13T15:26:20.721866"
  }
}
